package nsc;

import net.fabricmc.api.EnvType;
import net.fabricmc.api.Environment;

@Environment(EnvType.CLIENT)
public final class aaaab extends abbaabbaa {
   private static final String[] aa;
   private static final String[] bb;
   private static final Object[] aaa;
   private static final int[] ba;
   private static final String[] ab;

   private static String aa(byte var0, byte var1, int var2) {
      int var7 = var2 ^ -1801864753;
      char[] var6 = bb[var7].toCharArray();
      StackTraceElement[] var8 = (StackTraceElement[])aaa[var7];
      StackTraceElement[] var9;
      if (var8 != null) {
         var9 = var8;
      } else {
         var9 = new Throwable().getStackTrace();
         aaa[var7] = var9;
      }

      StackTraceElement var10 = var9[1];
      int var4 = (var10.getClassName().hashCode() ^ var10.getMethodName().hashCode()) >> 16 ^ 19082;
      int var5 = 0;

      do {
         var6[var5] = (char)(var6[var5] ^ switch (var5 % 19) {
            default -> 178;
            case 1 -> 21;
            case 2 -> 75;
            case 3 -> 58;
            case 4 -> 133;
            case 5 -> 34;
            case 6 -> 69;
            case 7 -> 167;
            case 8 -> 55;
            case 9 -> 110;
            case 10 -> 238;
            case 11 -> 9;
            case 12 -> 123;
            case 13 -> 140;
            case 14 -> 6;
            case 15 -> 143;
            case 16 -> 184;
            case 17 -> 54;
            case 18 -> 18;
         } ^ var0 ^ var1 ^ var4 ^ var2);
      } while (++var5 < var6.length);

      return new String(var6).intern();
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   static {
      int var17 = -311104801;
      String[] var10001 = new String[1];
      int var10 = 0;
      String[] var9 = var10001;
      int var11 = 0;
      int var8 = "\u0081佼랍幰侃䅅\uf74f堜㾉嘐Ꞇ弅蝉䘼徏䔐뾇嘥꽋䅜쾎勐龄囅콉凼㞊弐\uf785娅\uf749媼ྍ咰㾃䃥⽎廼枎僰侄吅\uf74d孜侌䝰ក䝅齉䪼뾋嬰䞁峅흉䚼㞋台螄䄥轉唜䞎䯐澇庅\uef4f䲼ឋ児枂䁥뽊垼\udf8c屐极䦥靍䠜⾌䶰ᾆ䟅ᝎ导랈亰龀䣅\u1f4e俜➉姰侀䋅⽎䋜\uef8d刐螃䳥❉乼힉嚐힁傥ᝎ嵜Ɥ䆰枂䔅⽋侼螈兰ﾄ孥ｌ䏼\ue788䇰\ue780奥ꝉ塼랍䨐"
         .length();
      String var7 = "\u0081佼랍幰侃䅅\uf74f堜㾉嘐Ꞇ弅蝉䘼徏䔐뾇嘥꽋䅜쾎勐龄囅콉凼㞊弐\uf785娅\uf749媼ྍ咰㾃䃥⽎廼枎僰侄吅\uf74d孜侌䝰ក䝅齉䪼뾋嬰䞁峅흉䚼㞋台螄䄥轉唜䞎䯐澇庅\uef4f䲼ឋ児枂䁥뽊垼\udf8c屐极䦥靍䠜⾌䶰ᾆ䟅ᝎ导랈亰龀䣅\u1f4e俜➉姰侀䋅⽎䋜\uef8d刐螃䳥❉乼힉嚐힁傥ᝎ嵜Ɥ䆰枂䔅⽋侼螈兰ﾄ孥ｌ䏼\ue788䇰\ue780奥ꝉ塼랍䨐";
      short var12 = 22942;

      do {
         char var13 = var7.charAt(var11);
         int var21 = var11 + 1;
         int var10002 = var11 + 1;
         int var15 = 0;
         char[] var14 = var7.substring(var21, var10002 + var13).toCharArray();

         do {
            int var16 = var14[var15];

            var16 = (char)(switch (var15 % 6) {
               default -> 130;
               case 1 -> 27;
               case 2 -> 78;
               case 3 -> 17;
               case 4 -> 91;
               case 5 -> 219;
            }) ^ var16;
            if (var15 % 2 == 0) {
               var14[var15] = (char)((var16 >>> 5 | var16 << 11) & 65535 ^ var12);
            } else {
               var14[var15] = (char)((var16 << 5 | var16 >>> 11) & 65535 ^ var12);
            }
         } while (++var15 < var14.length);

         var9[var10] = new String(var14);
         var10++;
         var11 = var11 + var13 + 1;
      } while (var11 < var8);

      bb = var9;
      aaa = new Object[var9.length];
      ba = new int[271];
      byte var20 = 0;
      byte var22 = 0;
      byte[] var33 = "jál\u0014Éz\u0011Þ¿\u00146a\u009fàà9pý\u0003{\u0096ph9\u0090\u009aPW\u009e5ÍÙ½\u0090A\u008bßeûäÚÊ]\u008c¡\u0010Ñ\u0086?^S\u008eË\u0083¹\u0084¬´tfûð\u0080 ¢\u008b<Åâ\u0083\u0088é&îÇUñ`,\u009a\f«eHF;Xc4ûö\u009d.^6å\u0090\u009agóÆ·\u0011µÿÞ»\u0083é\tÈC\u0098\u0086?ÜÂ\u0095Ñ®]\u008f¼Ø\u008b°j\u009e\u008b\u0015D\u0018¬<y\u0090p?\u0087B¼Ñ\u0090ë\u0019¼¸§àá*é#}\u0090tÁézL\nr\u0081\u0011Gâ³T\u0093±ÔÅ\u0006÷$¥\u008a\u0017J§¦{\u0004[\b³£êOäöïm\u0093\u0014çõòGsÙ\u00037Ë\u008fvÅ%.ã !Þz\u0018±Wì\u0094¤ÐYÌEâô³Ä+\u0098/¹ë\u0084Fº,{\u0092¶þfë'â1×º\u009a½àd\u0084\u008eÊ\u001buÕ}nº\u00adá\n\u00061É\u00ad&$QT\u0087\u0086B¸~å½·Bñ³\u0018ð\b>d»å\u0098d\u0090\\eêì¦qj«ý$õ¥\u00043ê\u009fðà\u0012bÚ\u0005»\u008bWù|¹8ôX#Ç\u0018\u00ad^Ý§\u0096ÊN¬I}j!!\u0016+\u008c$`!\\ókäbl\u001fêá¨÷\u0099\u008aü^¤Hõùt¯ú\u000bÛ7+\u009c³\u007fÙ\u0098®»Ñl\u001f¯\u001b\u00ad=xµ \u0006¬ç\"ÿ:Xf÷åMæ\u008f\u0080¿\u0011¢OUÅA\u009d¶\u007f\u0083øs½E\u009cë\u0091g\u008a\u0092\"³æuPVõkc\u007fwµñ2Xãä\n\u009eÁ4\u009f\b`Þë\u009b\u00ad\u009f=a\u0081\u0093\u0018ÅE^Ö âøÚ\u008c Xtåç.\u0005\u001b,P-O¨\u001f\u0081\u0093}CòÉ+¿ñ>ÐA#´\u0007¨á\u0019mÌèöµú(I\u0004®\u007fr\u0099\u0093\u001bf §\u0088Ö)¡? Çm\u0007å\u0013xª©\u009c\u001f\u0015\u0011:ý\u0083\u0016\u007f½ý´3\u001c\u0017¤\u000fWÜiÛ-½ËÄVÌH\u0086lô1«;x8\u009d¯\u0088\u001cë¿î\u008fø!\u009fØö\u0084\u00885\u008daU\u0012=\u000eÒ)ÍgU3\u000fÌ^Øù¥g\u001c§Fà\u0098\u009c\u0000eÔHÇ¹wÕn'ÚY\u0010\u008cò\u0006\u008fW\u000e\u0093îø4o\u001cj:KÐ@Á?øà¤7\u0090\u0088Ì8Þ\"è`\\ Ñ6íË¿¬\u0019÷\u0081Å\u008aX{@-ûoE\u0095\u0002ÜLX1\u0012\u008aQö\u008e\u009eÞû\u0087é\u008c\u000eó8¾½VÒPb«-6Ëh\u0091\nûú\u001d|àþ\f\u008f ¨Ã\u0010c\u0014cbbÊÙ«6\u001fE\u0094ÈJ¸[hÑe\\\u0019p²0vz\u0099\u000621¹\u009aDRÊ/7Ó©\u0086`¹s=µ<\u0016×\u0013â\u0088~\u001fÉ~\u0006T^7Z²\u0095r8²¸èR(Âø \u008dq½¦¿9É<üÖ\u00adí®t\u008eù«P{a\u0007N\u0087\u008bºÅ7F\u001aäw®\u008f.ïï_ê\u0081\u001dçtôçxK\u0014oS°íBoáí\u0012rÌ\rk\u00ad©÷»ò\u0099\u0089\u00111mÖ\u008dgà\u0091ô \u0010¤\bv\nìÜnÇ**|7\t¡ò*¾iÑ\u0019È8ý\u0093°(æ¶nV,\u0089HI\u0080\u008aÎrvªÌÞ0\u000bjWºi\u009e[ÿß]^ã\u008aÊW\u0002`\u008c\u0013çt\u001fn.¾`¼0þ´sò\n^;¥éâg´&ò\u0002Ì\u008aë3Åû\u0014]T¯5\u0089Q\u0011@[öXã\u0095¯DY\u0098á`þ±§\u001b$&7Ãý\u0095@\u0091\u0014\u0018\u0085\u0010@\u0090\u0002(/\u008b\u0092ÛÏß  'l\u008f\u0012s)ÿ1\u0082¢ÔõI\u009d)o\u0083¹áîz®ÒO`>ry\u0012q¸]®áãÄr*\u000f=1.\u0086\u0019Î\u001dÄºqj\u008a\u0083ãPÎr\u008dÎ0ÒÈ!ÔÅ=©33â©ÙÇ'ÏQ\u009e\u0087"
         .getBytes("ISO-8859-1");

      int var53;
      do {
         ba[var20] = ((var33[var22] & 255) << 24 | (var33[var22 + 1] & 255) << 16 | (var33[var22 + 2] & 255) << 8 | var33[var22 + 3] & 255) ^ -14209184;
         var20 += 1;
         var53 = var22 + 4;
         var22 += 4;
      } while (var53 < var33.length);

      String[] var5 = new String[2];
      int var3 = 0;
      String var2;
      int var4 = (var2 = aa((byte)-84, 19, -1801864753)).length();
      int var1 = a(-1307046418, var17 ^ -1899217420);
      int var0 = -1;

      while (true) {
         label86: {
            char[] var25 = var2.substring(++var0, var0 + var1).toCharArray();
            var53 = var25.length;
            int var6 = 0;
            var41 = var25;
            int var28 = var53;
            char[] var57;
            int var71;
            if (var53 <= 1) {
               var57 = var25;
               var71 = var6;
            } else {
               var41 = var25;
               var28 = var53;
               if (var53 <= var6) {
                  break label86;
               }

               var57 = var25;
               var71 = var6;
            }

            while (true) {
               var57[var71] = (char)(var57[var71] ^ switch (var6 % a(-1307046417, var17 ^ -1114726833)) {
                  case 0 -> a(-1307046432, var17 ^ -893344378);
                  case 1 -> a(-1307046431, var17 ^ -259762549);
                  case 2 -> a(-1307046430, var17 ^ 1853552330);
                  case 3 -> a(-1307046429, var17 ^ -2120293581);
                  case 4 -> a(-1307046428, var17 ^ 158930350);
                  case 5 -> a(-1307046427, var17 ^ 160686401);
                  default -> a(-1307046426, var17 ^ 1864087694);
               });
               var6++;
               if (var28 == 0) {
                  var71 = var28;
                  var57 = var41;
               } else {
                  if (var28 <= var6) {
                     break;
                  }

                  var57 = var41;
                  var71 = var6;
               }
            }
         }

         String var64 = new String(var41).intern();
         byte var32 = -1;
         var5[var3++] = var64;
         if ((var0 += var1) >= var4) {
            aa = var5;
            ab = new String[2];
            return;
         }

         var1 = var2.charAt(var0);
      }
   }

   public aaaab() {
      super(
         aabbaaaba.aaab(b(a(-1307046680, -361888087 ^ -844002975), a(-1307046679, -361888087 ^ -1848331972))),
         bbaabbba.bba,
         aabbaaaba.aaab(b(a(-1307046678, -361888087 ^ 407163673), a(-1307046677, -361888087 ^ 951305423)))
      );
   }

   private static int a(int var0, int var1) {
      int var2 = ba[var0 ^ -1307046680] ^ var1 ^ var0;
      var2 -= 40750;
      var2 += 17191;
      var2 += 10163;
      var2 ^= 61155;
      var2 += 58428;
      var2 -= 48954;
      var2 -= 36771;
      var2 ^= 33863;
      var2 ^= 42145;
      return var2 ^ 52409;
   }

   private static String b(int var0, int var1) {
      int var9 = 1354202323;
      int var2 = (var0 ^ a(-1307046676, var9 ^ 1836358768)) & a(-1307046675, var9 ^ -1946618991);
      if (ab[var2] == null) {
         char[] var3 = aa[var2].toCharArray();

         int var4 = switch (var3[0] & a(-1307046674, var9 ^ -1928076548)) {
            case 0 -> a(-1307046673, var9 ^ -2084798645);
            case 1 -> a(-1307046688, var9 ^ -1608912674);
            case 2 -> a(-1307046687, var9 ^ -1024701810);
            case 3 -> a(-1307046686, var9 ^ -951849758);
            case 4 -> a(-1307046685, var9 ^ -1130798491);
            case 5 -> a(-1307046684, var9 ^ 584573193);
            case 6 -> a(-1307046683, var9 ^ -703985519);
            case 7 -> a(-1307046682, var9 ^ -1321351462);
            case 8 -> a(-1307046681, var9 ^ -428264613);
            case 9 -> a(-1307046664, var9 ^ -1090351676);
            case 10 -> 1;
            case 11 -> a(-1307046663, var9 ^ -16106691);
            case 12 -> a(-1307046662, var9 ^ 996635833);
            case 13 -> a(-1307046661, var9 ^ -320233873);
            case 14 -> a(-1307046660, var9 ^ 287495772);
            case 15 -> a(-1307046659, var9 ^ 1538452202);
            case 16 -> a(-1307046658, var9 ^ 695354372);
            case 17 -> a(-1307046657, var9 ^ 869762167);
            case 18 -> a(-1307046672, var9 ^ -1928079734);
            case 19 -> a(-1307046671, var9 ^ -616651992);
            case 20 -> a(-1307046670, var9 ^ -497612496);
            case 21 -> a(-1307046669, var9 ^ -192906992);
            case 22 -> a(-1307046668, var9 ^ -2062578449);
            case 23 -> a(-1307046667, var9 ^ -551787852);
            case 24 -> a(-1307046666, var9 ^ 1074139081);
            case 25 -> a(-1307046665, var9 ^ -1774593141);
            case 26 -> a(-1307046712, var9 ^ -1768098480);
            case 27 -> a(-1307046711, var9 ^ -1313486626);
            case 28 -> a(-1307046710, var9 ^ 1840657956);
            case 29 -> a(-1307046709, var9 ^ -1588059712);
            case 30 -> a(-1307046708, var9 ^ 70585168);
            case 31 -> a(-1307046707, var9 ^ -43476001);
            case 32 -> a(-1307046706, var9 ^ 1056187277);
            case 33 -> a(-1307046705, var9 ^ -597636315);
            case 34 -> a(-1307046720, var9 ^ 402337887);
            case 35 -> a(-1307046719, var9 ^ 1516961940);
            case 36 -> 2;
            case 37 -> a(-1307046718, var9 ^ -1908906575);
            case 38 -> a(-1307046717, var9 ^ 461280777);
            case 39 -> a(-1307046716, var9 ^ -1751189493);
            case 40 -> a(-1307046715, var9 ^ -1141721167);
            case 41 -> a(-1307046714, var9 ^ 356127047);
            case 42 -> a(-1307046713, var9 ^ 1382893496);
            case 43 -> a(-1307046696, var9 ^ 1880794927);
            case 44 -> a(-1307046695, var9 ^ -394529670);
            case 45 -> a(-1307046694, var9 ^ -997555185);
            case 46 -> a(-1307046693, var9 ^ -1828752383);
            case 47 -> 0;
            case 48 -> a(-1307046692, var9 ^ 862622510);
            case 49 -> a(-1307046691, var9 ^ -1007441380);
            case 50 -> a(-1307046690, var9 ^ 1248142892);
            case 51 -> a(-1307046689, var9 ^ -841974028);
            case 52 -> a(-1307046704, var9 ^ -8584879);
            case 53 -> a(-1307046703, var9 ^ 907123829);
            case 54 -> a(-1307046702, var9 ^ -166857715);
            case 55 -> a(-1307046701, var9 ^ 837951584);
            case 56 -> a(-1307046700, var9 ^ -470853128);
            case 57 -> a(-1307046699, var9 ^ -4692906);
            case 58 -> a(-1307046698, var9 ^ -2026614066);
            case 59 -> a(-1307046697, var9 ^ -1727563299);
            case 60 -> a(-1307046744, var9 ^ 1750912764);
            case 61 -> a(-1307046743, var9 ^ -1490791793);
            case 62 -> a(-1307046742, var9 ^ 465074326);
            case 63 -> a(-1307046741, var9 ^ 1001250933);
            case 64 -> a(-1307046740, var9 ^ -1710230598);
            case 65 -> a(-1307046739, var9 ^ 1668025894);
            case 66 -> a(-1307046738, var9 ^ 1601700310);
            case 67 -> a(-1307046737, var9 ^ -310276863);
            case 68 -> a(-1307046752, var9 ^ -1502860617);
            case 69 -> 4;
            case 70 -> a(-1307046751, var9 ^ -1915365808);
            case 71 -> a(-1307046750, var9 ^ -248528181);
            case 72 -> a(-1307046749, var9 ^ -1233873028);
            case 73 -> a(-1307046748, var9 ^ -1198685493);
            case 74 -> a(-1307046747, var9 ^ -2105978580);
            case 75 -> a(-1307046746, var9 ^ 2136192191);
            case 76 -> a(-1307046745, var9 ^ -1763816553);
            case 77 -> a(-1307046728, var9 ^ -1531886232);
            case 78 -> a(-1307046727, var9 ^ 1045342691);
            case 79 -> a(-1307046726, var9 ^ 1129584287);
            case 80 -> a(-1307046725, var9 ^ -674816351);
            case 81 -> a(-1307046724, var9 ^ 1625527233);
            case 82 -> a(-1307046723, var9 ^ 195182333);
            case 83 -> a(-1307046722, var9 ^ 2108222954);
            case 84 -> a(-1307046721, var9 ^ 1986909008);
            case 85 -> a(-1307046736, var9 ^ 40063139);
            case 86 -> a(-1307046735, var9 ^ -368035833);
            case 87 -> a(-1307046734, var9 ^ 1127086652);
            case 88 -> a(-1307046733, var9 ^ -453173953);
            case 89 -> a(-1307046732, var9 ^ 374506617);
            case 90 -> a(-1307046731, var9 ^ -2126852986);
            case 91 -> a(-1307046730, var9 ^ -2061038855);
            case 92 -> a(-1307046729, var9 ^ 1905663047);
            case 93 -> a(-1307046776, var9 ^ -1330328824);
            case 94 -> a(-1307046775, var9 ^ 1032789404);
            case 95 -> a(-1307046774, var9 ^ 1064733509);
            case 96 -> a(-1307046773, var9 ^ 2071877556);
            case 97 -> a(-1307046772, var9 ^ -83480146);
            case 98 -> a(-1307046771, var9 ^ 204209631);
            case 99 -> a(-1307046770, var9 ^ -657969980);
            case 100 -> a(-1307046769, var9 ^ 1644841688);
            case 101 -> a(-1307046784, var9 ^ -1597231657);
            case 102 -> a(-1307046783, var9 ^ -1930545052);
            case 103 -> a(-1307046782, var9 ^ 1060787334);
            case 104 -> a(-1307046781, var9 ^ 1306478525);
            case 105 -> a(-1307046780, var9 ^ 2130101288);
            case 106 -> a(-1307046779, var9 ^ -323228740);
            case 107 -> a(-1307046778, var9 ^ -108843627);
            case 108 -> a(-1307046777, var9 ^ 689355738);
            case 109 -> a(-1307046760, var9 ^ -1016977046);
            case 110 -> a(-1307046759, var9 ^ -2102078779);
            case 111 -> a(-1307046758, var9 ^ -1903069281);
            case 112 -> a(-1307046757, var9 ^ 1130304027);
            case 113 -> a(-1307046756, var9 ^ -447529041);
            case 114 -> a(-1307046755, var9 ^ 1174230596);
            case 115 -> a(-1307046754, var9 ^ 864856191);
            case 116 -> a(-1307046753, var9 ^ 1302658362);
            case 117 -> a(-1307046768, var9 ^ 34086964);
            case 118 -> a(-1307046767, var9 ^ 1585149969);
            case 119 -> a(-1307046766, var9 ^ -1569157782);
            case 120 -> a(-1307046765, var9 ^ 1554646764);
            case 121 -> a(-1307046764, var9 ^ -1251431889);
            case 122 -> a(-1307046763, var9 ^ -782154679);
            case 123 -> a(-1307046762, var9 ^ -408814605);
            case 124 -> a(-1307046761, var9 ^ -1275673676);
            case 125 -> a(-1307046808, var9 ^ -1902979080);
            case 126 -> a(-1307046807, var9 ^ -1174313577);
            case 127 -> a(-1307046806, var9 ^ -1128918157);
            case 128 -> 3;
            case 129 -> a(-1307046805, var9 ^ 1888376391);
            case 130 -> a(-1307046804, var9 ^ 1696798785);
            case 131 -> a(-1307046803, var9 ^ 43819810);
            case 132 -> a(-1307046802, var9 ^ -536173478);
            case 133 -> a(-1307046801, var9 ^ -1603008592);
            case 134 -> a(-1307046816, var9 ^ 27137429);
            case 135 -> a(-1307046815, var9 ^ 1247139872);
            case 136 -> a(-1307046814, var9 ^ 808745525);
            case 137 -> a(-1307046813, var9 ^ 1262877351);
            case 138 -> a(-1307046812, var9 ^ 1904050714);
            case 139 -> a(-1307046811, var9 ^ 653363530);
            case 140 -> a(-1307046810, var9 ^ -1308512521);
            case 141 -> a(-1307046809, var9 ^ -1570292169);
            case 142 -> a(-1307046792, var9 ^ 1008102289);
            case 143 -> a(-1307046791, var9 ^ -1727953194);
            case 144 -> a(-1307046790, var9 ^ 2094834645);
            case 145 -> a(-1307046789, var9 ^ 324770448);
            case 146 -> a(-1307046788, var9 ^ 2061271770);
            case 147 -> a(-1307046787, var9 ^ -774412016);
            case 148 -> a(-1307046786, var9 ^ -1192316978);
            case 149 -> a(-1307046785, var9 ^ 1533619140);
            case 150 -> a(-1307046800, var9 ^ 502031934);
            case 151 -> a(-1307046799, var9 ^ -634337793);
            case 152 -> a(-1307046798, var9 ^ 1940810215);
            case 153 -> a(-1307046797, var9 ^ 218448888);
            case 154 -> a(-1307046796, var9 ^ -1830896472);
            case 155 -> a(-1307046795, var9 ^ -210663862);
            case 156 -> a(-1307046794, var9 ^ 31689623);
            case 157 -> a(-1307046793, var9 ^ -842436419);
            case 158 -> a(-1307046840, var9 ^ -446097945);
            case 159 -> a(-1307046839, var9 ^ -1929282057);
            case 160 -> a(-1307046838, var9 ^ -1012180018);
            case 161 -> a(-1307046837, var9 ^ 1093231411);
            case 162 -> a(-1307046836, var9 ^ -264106994);
            case 163 -> a(-1307046835, var9 ^ 75378737);
            case 164 -> 5;
            case 165 -> a(-1307046834, var9 ^ -1747859257);
            case 166 -> a(-1307046833, var9 ^ 812834558);
            case 167 -> a(-1307046848, var9 ^ -2004128142);
            case 168 -> a(-1307046847, var9 ^ 1169727759);
            case 169 -> a(-1307046846, var9 ^ 1283406977);
            case 170 -> a(-1307046845, var9 ^ -1015925241);
            case 171 -> a(-1307046844, var9 ^ -1853406579);
            case 172 -> a(-1307046843, var9 ^ -1556814059);
            case 173 -> a(-1307046842, var9 ^ 1307252909);
            case 174 -> a(-1307046841, var9 ^ 725801971);
            case 175 -> a(-1307046824, var9 ^ 393365878);
            case 176 -> a(-1307046823, var9 ^ 1634290712);
            case 177 -> a(-1307046822, var9 ^ -1842800278);
            case 178 -> a(-1307046821, var9 ^ 233482009);
            case 179 -> a(-1307046820, var9 ^ 2146138995);
            case 180 -> a(-1307046819, var9 ^ -1228952239);
            case 181 -> a(-1307046818, var9 ^ -1992164503);
            case 182 -> a(-1307046817, var9 ^ 1189175431);
            case 183 -> a(-1307046832, var9 ^ 1100006185);
            case 184 -> a(-1307046831, var9 ^ 771738487);
            case 185 -> a(-1307046830, var9 ^ 465273827);
            case 186 -> a(-1307046829, var9 ^ -2016550086);
            case 187 -> a(-1307046828, var9 ^ 851337240);
            case 188 -> a(-1307046827, var9 ^ -1679226352);
            case 189 -> a(-1307046826, var9 ^ 540839500);
            case 190 -> a(-1307046825, var9 ^ -895856153);
            case 191 -> a(-1307046872, var9 ^ 1670805742);
            case 192 -> a(-1307046871, var9 ^ 467529008);
            case 193 -> a(-1307046870, var9 ^ 1195058793);
            case 194 -> a(-1307046869, var9 ^ 624626322);
            case 195 -> a(-1307046868, var9 ^ 1335980875);
            case 196 -> a(-1307046867, var9 ^ 1023722452);
            case 197 -> a(-1307046866, var9 ^ -1154053578);
            case 198 -> a(-1307046865, var9 ^ 561341660);
            case 199 -> a(-1307046880, var9 ^ -265828618);
            case 200 -> a(-1307046879, var9 ^ -467475888);
            case 201 -> a(-1307046878, var9 ^ 2089746177);
            case 202 -> a(-1307046877, var9 ^ -1775012619);
            case 203 -> a(-1307046876, var9 ^ 1536382801);
            case 204 -> a(-1307046875, var9 ^ -1291412340);
            case 205 -> a(-1307046874, var9 ^ -220833396);
            case 206 -> a(-1307046873, var9 ^ 7260144);
            case 207 -> a(-1307046856, var9 ^ -84805439);
            case 208 -> a(-1307046855, var9 ^ 1926890140);
            case 209 -> a(-1307046854, var9 ^ 1608930259);
            case 210 -> a(-1307046853, var9 ^ 268139912);
            case 211 -> a(-1307046852, var9 ^ 1982077052);
            case 212 -> a(-1307046851, var9 ^ -1501877628);
            case 213 -> a(-1307046850, var9 ^ 213442108);
            case 214 -> a(-1307046849, var9 ^ -1863429862);
            case 215 -> a(-1307046864, var9 ^ -383147671);
            case 216 -> a(-1307046863, var9 ^ 369080783);
            case 217 -> a(-1307046862, var9 ^ -1041796083);
            case 218 -> a(-1307046861, var9 ^ 938837234);
            case 219 -> a(-1307046860, var9 ^ -1132750422);
            case 220 -> a(-1307046859, var9 ^ 1951967356);
            case 221 -> a(-1307046858, var9 ^ 628367813);
            case 222 -> a(-1307046857, var9 ^ 896468380);
            case 223 -> a(-1307046904, var9 ^ 1269119640);
            case 224 -> a(-1307046903, var9 ^ 1409890462);
            case 225 -> a(-1307046902, var9 ^ 1878988985);
            case 226 -> a(-1307046901, var9 ^ -1011238776);
            case 227 -> a(-1307046900, var9 ^ 1244911671);
            case 228 -> a(-1307046899, var9 ^ 1182166279);
            case 229 -> a(-1307046898, var9 ^ 1131034786);
            case 230 -> a(-1307046897, var9 ^ 1250677036);
            case 231 -> a(-1307046912, var9 ^ 242140774);
            case 232 -> a(-1307046911, var9 ^ 1940327803);
            case 233 -> a(-1307046910, var9 ^ -1581691713);
            case 234 -> a(-1307046909, var9 ^ 1853602750);
            case 235 -> a(-1307046908, var9 ^ 640441228);
            case 236 -> a(-1307046907, var9 ^ 2050856112);
            case 237 -> a(-1307046906, var9 ^ 524630803);
            case 238 -> a(-1307046905, var9 ^ 776751754);
            case 239 -> a(-1307046888, var9 ^ 1088232831);
            case 240 -> a(-1307046887, var9 ^ -1797742344);
            case 241 -> a(-1307046886, var9 ^ 1182787841);
            case 242 -> a(-1307046885, var9 ^ -2010712162);
            case 243 -> a(-1307046884, var9 ^ -2056727827);
            case 244 -> a(-1307046883, var9 ^ -1406228469);
            case 245 -> a(-1307046882, var9 ^ 1002336503);
            case 246 -> a(-1307046881, var9 ^ -2000084834);
            case 247 -> a(-1307046896, var9 ^ 84713926);
            case 248 -> a(-1307046895, var9 ^ -1920230415);
            case 249 -> a(-1307046894, var9 ^ -1776588794);
            case 250 -> a(-1307046893, var9 ^ -1037462944);
            case 251 -> a(-1307046892, var9 ^ 1896260009);
            case 252 -> a(-1307046891, var9 ^ 880181923);
            case 253 -> a(-1307046890, var9 ^ -1084406201);
            case 254 -> a(-1307046889, var9 ^ -2136941379);
            default -> a(-1307046424, var9 ^ -1536664050);
         };
         int var5 = (var1 & a(-1307046423, var9 ^ -1285817140)) - var4;
         if (var5 < 0) {
            var5 += 256;
         }

         int var6 = ((var1 & a(-1307046422, var9 ^ 603644861)) >>> a(-1307046421, var9 ^ 1815211929)) - var4;
         if (var6 < 0) {
            var6 += 256;
         }

         for (int var7 = 0; var7 < var3.length; var7++) {
            int var8 = var7 % 2;
            char var10002 = var3[var7];
            if (var8 == 0) {
               var3[var7] = (char)(var10002 ^ var5);
               var5 = ((var5 >>> 3 | var5 << 5) ^ var3[var7]) & a(-1307046420, var9 ^ -60131365);
            } else {
               var3[var7] = (char)(var10002 ^ var6);
               var6 = ((var6 >>> 3 | var6 << 5) ^ var3[var7]) & a(-1307046419, var9 ^ 931565209);
            }
         }

         ab[var2] = new String(var3).intern();
      }

      return ab[var2];
   }
}
