package nsc;

import net.fabricmc.api.EnvType;
import net.fabricmc.api.Environment;

@Environment(EnvType.CLIENT)
public final class aabbba extends abbaabbaa {
   private static final Object[] aaa;
   private static final String[] aa;
   private static final int[] ba;
   private static final String[] ab;
   private static final String[] bb;

   private static int a(int var0, int var1) {
      int var2 = ba[var0 ^ -761071925] ^ var1 ^ var0;
      var2 -= 10151;
      var2 += 5700;
      var2 ^= 12210;
      var2 -= 61842;
      var2 -= 35122;
      var2 -= 37287;
      var2 -= 14163;
      var2 -= 45400;
      return var2 - 28674;
   }

   public aabbba() {
      super(
         aabbaaaba.aaab(b(a(-761071934, -1237758560 ^ -120208289), a(-761071935, -1237758560 ^ -495046964))),
         bbaabbba.bab,
         aabbaaaba.aaab(b(a(-761071936, -1237758560 ^ -102287744), a(-761071929, -1237758560 ^ -1760818660)))
      );
   }

   private static String aa(int var0, short var1, int var2, short var3, int var4, int var5, byte var6) {
      int var11 = var0 ^ 627895468;
      char[] var10 = bb[var11].toCharArray();
      StackTraceElement[] var12 = (StackTraceElement[])aaa[var11];
      StackTraceElement[] var13;
      if (var12 != null) {
         var13 = var12;
      } else {
         var13 = new Throwable().getStackTrace();
         aaa[var11] = var13;
      }

      StackTraceElement var14 = var13[1];
      int var8 = (var14.getClassName().hashCode() ^ var14.getMethodName().hashCode()) >> 16 ^ 62369;
      int var9 = 0;

      do {
         var10[var9] = (char)(var10[var9] ^ 17194 ^ var0 ^ var2 ^ var6 ^ var3 ^ var8 ^ var4 ^ var1 ^ var5);
      } while (++var9 < var10.length);

      return new String(var10).intern();
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   static {
      int var18 = -1459819898;
      char[] var9 = "E".toCharArray();
      byte var14 = -1;
      String var8 = "낙뀲냃끙뀢뀏뀳끣냅뀑낦끏낅냟뀙뀛뀥낽뀡뀱뀎냟낦냎낤낋낂냻낋끩끧끄뀶냯냳낫뀧뀑끆냼냜뀈낱뀱뀣끀뀄끐끑뀊끃냏끺냱냦뀸뀮냂냤낎뀕끀끏낢낱낊끥냢낚";
      short var7 = 9789;
      String[] var10 = new String[var9.length];

      while (true) {
         int var11 = 0;
         char var12 = 0;
         char var13 = '\u0000';
         if (var14 == 0) {
            bb = var10;
            aaa = new Object[var10.length];
            ba = new int[271];
            byte var21 = 0;
            int var10001 = 0;
            byte[] var10002 = "Ù\u008ai¸¯ÐV\u0006\u000b\u001c/q4^÷*ÞÃxÑ\u008es÷\u008c§kÆH \u0093O\tU±O\u0019ã}\u0086YùÖ\u009aTâOt\u008b\u008c¤\u0099¥à!î¬ï\u001a.{»ÜÊLf£öÕ¬ÅÓ¦Ù\u0084\u007fzé\u001b°t\u001f\u007fÛ\u009b°\u0090è{j\u0095@kÖ\u0087Ct£§\u009eÁG \u0019X{±i\u001d\u008e\f\u0013FTÿ!_ÎÇ³\u008aéDdå\u0006³Ë1-³¡æíà·EÃÏæ\u0000a«\u0098Ê\u008b\u0017\u0093\u008boXwP\u0013Â\u0091A£üý\t4\u0082\u0010í\u0003xçÛ\"uÑ³cB\u001c÷\u0011\u0081Iwµ¡\u0005JS^*W\u0014`mdx¨Çñæ¯m\u0095øÏ¡W\u009fÊ\u0017N+&Ò)ê5Ó^@}Ù\u0081\u008e6!*©¸\u008f\u0004dþ§±Ját-G/×¦\u008eÀf<¶_:h43\u009b\u009c\u0019zÓcÉ\u0014/W·\u009d\u009duy'Pt;1]Íæ.û\u0088Fv\u0012¨·gb5\u0010´¿Ð\u0090p!\"¨\u0015Mÿ~\u00163°\u008fýõ6\u0093]4\u0099ì+Á¯Õ~>õ¹KØ'êT¢>\bûy\u008eýMS´s\u0093n\\^è\u008aÖ\u0012ê\u00ad\u0007é\u001d\u000fÙê\rçÚÎv>ùË\u0018!\u0090\u0016ºï>É\u0015Îq\u0018ô\b\u0093á\u001a\u009fq\u0019C0y\u008dâx\u0090¼\u0015\u0001ÂDß¶]qÑõ¨Ë&\u0016?\u000eßÒ«»$\u0018\b{Õ\n×p¬\u001e\u007fnm\u000eX\u009d·\u0092\u009cÚÓa\u001c^r¤.K¹y\u008a\u0098yÎO\u0003Å\b\u0091¥\bs\"dÀ\u008f³Çïd!\u00875P¬ù¡òT\u001d`/ÿ~û,Ì¾;\u0013\u0012ÑYQ¸\u0091\u0096\u0004ÌMÜùTv°\u00023ú`l\u008a\u001b\u0017Å\u009bUV\u0081ªL8\u0017®àê2è¯\rÒKâ3\u0093\u00adbµäGÀX\u0002MW\u0091¯Â$©ÈQ0µ\në\rÈ\u0007\u0010¶®\\ê\u0017ì5&\u0082\u007f?ý}8ë\u0013p\u0097%\u0084\u000f\u0081\u0019ëò!\u009f\u0094ë\u0095E\u00816>\u0080\u0082)\u0080W¢\u0095çp\u0014\u001ay\u000e\u0019gç0&\u0091¦ieW\u0012\u0083W\u0005\u0018ê¯lQ\bú¢\u0010@sQ\tÞl\u0003g¡T'É4\u001f}²¦\u0010}Í&>Ö³ú\u0082$n¨XÚ\u0085\rCÿÿJÐøÍÖ+ª\\è\u0084\u0088§1\u0093x\u009c\u009fnþ¹ª=¥ß(Î:ðhÓ\u008bô\f®µÖ²Qxç\u009bOÎ!Æ6ù \u0015\u0087Åf\u0099-z6Çë>¸Í\u0098\u008d\u0091@¬#\u001e>Ü&)©k¨\u001a\u0092Eq\u0086\u008dò\u0093\u0085ãB\u0095\u008föÉ\u009c\u000fp\u009a\u0010Úb\u001aá\u0017lCØó\u0011\u008aµXh\u0002\u0004ãT\b»$\u0081V«õÝÑX\u0005\">ÂÃRß\u001f\u0094\u0091\u0088}2e\u000f¿*H@À(DáýÇJkÅÑ\u0004ÛN\u009798\u0012í6Hh\u009f\u0085ÂlÁÿb\u0007,\u0093L*ëý¨6¤å\u008f©\u0003\u0081\u0013´©q\u0092\fØ\u0002¸ëg\u008fQU\u009fG`\u0085¤\u0013ígõ¶hÛN\u0012'u!\u0091[É$\n9Ò\u0084\u0013\u009aµ\u00896cÿsÆ\u0091÷f¤}Ë£©nÿo5àÉ&\u008b\u001ehÍ\u0018w\u0087Où\u000bä¦h ?\fµJ¦\n\u009f\u0005÷]ßÇa\u0016v·\u0017\u00ad4ÜH/ñÂù÷!»,\u000fzÝ9\u009fg÷\u0012eÛæEñÞOÝÍ>\f@(P\u0099Ô\b~¹ôJüòÃ\u009cùµ,\fr)\u0088+\u009c,Ík¯ÙïÑ\u0010\u009e \u009f\u0093\u0012mÚ\u0004ñ\u008as\u0016Zõ\fÐ:\u0087\u0091\f\u009bÕT/è@Z\u0090~c;t«\u00ad\bG;9\u0015kUka§\u008dÆ8%<ß¦\u0083Wµ\u0091í¿\t\u001d>à\u001c\u0013\u009bÔÐ&±\u0014¹-åÒ(ÊÃÄÁ9F9\u00055OJû\u0015\f){åN\u008c"
               .getBytes("ISO-8859-1");

            int var51;
            do {
               ba[var21] = (
                     (var10002[var10001] & 255) << 24
                        | (var10002[var10001 + 1] & 255) << 16
                        | (var10002[var10001 + 2] & 255) << 8
                        | var10002[var10001 + 3] & 255
                  )
                  ^ 2133889363;
               var21 += 1;
               var51 = var10001 + 4;
               var10001 += 4;
            } while (var51 < var10002.length);

            String[] var5 = new String[2];
            int var3 = 0;
            String var2;
            int var4 = (var2 = aa(627895468, 21553, 783931639, (short)-9260, 899808074, 194390171, (byte)-113)).length();
            int var1 = a(-761071925, var18 ^ -588791973);
            int var0 = -1;

            while (true) {
               label87: {
                  char[] var24 = var2.substring(++var0, var0 + var1).toCharArray();
                  var51 = var24.length;
                  int var6 = 0;
                  var39 = var24;
                  var10001 = var51;
                  char[] var55;
                  int var69;
                  if (var51 <= 1) {
                     var55 = var24;
                     var69 = var6;
                  } else {
                     var39 = var24;
                     var10001 = var51;
                     if (var51 <= var6) {
                        break label87;
                     }

                     var55 = var24;
                     var69 = var6;
                  }

                  while (true) {
                     var55[var69] = (char)(var55[var69] ^ switch (var6 % a(-761071926, var18 ^ -1430419703)) {
                        case 0 -> a(-761071927, var18 ^ 242351661);
                        case 1 -> a(-761071928, var18 ^ 825435752);
                        case 2 -> a(-761071921, var18 ^ -609310311);
                        case 3 -> a(-761071922, var18 ^ -1960958288);
                        case 4 -> a(-761071923, var18 ^ -1576659188);
                        case 5 -> a(-761071924, var18 ^ 637443650);
                        default -> a(-761071933, var18 ^ 1356634523);
                     });
                     var6++;
                     if (var10001 == 0) {
                        var69 = var10001;
                        var55 = var39;
                     } else {
                        if (var10001 <= var6) {
                           break;
                        }

                        var55 = var39;
                        var69 = var6;
                     }
                  }
               }

               String var62 = new String(var39).intern();
               byte var31 = -1;
               var5[var3++] = var62;
               if ((var0 += var1) >= var4) {
                  ab = var5;
                  aa = new String[2];
                  return;
               }

               var1 = var2.charAt(var0);
            }
         }

         do {
            var13 = var9[var11];
            char[] var15 = var8.substring(var12, var12 + var13).toCharArray();
            int var16 = 0;

            do {
               short var17 = switch (var16 % 6) {
                  default -> 98;
                  case 1 -> 176;
                  case 2 -> 39;
                  case 3 -> 243;
                  case 4 -> 135;
                  case 5 -> 39;
               };
               var15[var16] = (char)(var15[var16] ^ var17 ^ var7);
            } while (++var16 < var15.length);

            var10[var11] = new String(var15).intern();
            var12 += var13;
         } while (++var11 < var9.length);

         var14 = 0;
      }
   }

   private static String b(int var0, int var1) {
      int var9 = 125178698;
      int var2 = (var0 ^ a(-761071930, var9 ^ 1254552132)) & a(-761071931, var9 ^ 1174013615);
      if (aa[var2] == null) {
         char[] var3 = ab[var2].toCharArray();

         int var4 = switch (var3[0] & a(-761071932, var9 ^ 289138073)) {
            case 0 -> a(-761071909, var9 ^ -867903006);
            case 1 -> a(-761071910, var9 ^ 102955827);
            case 2 -> a(-761071911, var9 ^ 1935890418);
            case 3 -> a(-761071912, var9 ^ 1140629445);
            case 4 -> a(-761071905, var9 ^ -1248267398);
            case 5 -> a(-761071906, var9 ^ 444057402);
            case 6 -> a(-761071907, var9 ^ -1066243855);
            case 7 -> a(-761071908, var9 ^ 2086694001);
            case 8 -> a(-761071917, var9 ^ 155234734);
            case 9 -> a(-761071918, var9 ^ -314099972);
            case 10 -> a(-761071919, var9 ^ -782875079);
            case 11 -> a(-761071920, var9 ^ 619396155);
            case 12 -> a(-761071913, var9 ^ -31979060);
            case 13 -> a(-761071914, var9 ^ 1679858871);
            case 14 -> a(-761071915, var9 ^ 1134775088);
            case 15 -> a(-761071916, var9 ^ -1403722522);
            case 16 -> a(-761071893, var9 ^ -2024501575);
            case 17 -> a(-761071894, var9 ^ 1191681947);
            case 18 -> a(-761071895, var9 ^ 1764280682);
            case 19 -> a(-761071896, var9 ^ -884164611);
            case 20 -> a(-761071889, var9 ^ 569424897);
            case 21 -> a(-761071890, var9 ^ -977315815);
            case 22 -> 4;
            case 23 -> a(-761071891, var9 ^ -1188708660);
            case 24 -> a(-761071892, var9 ^ 152818301);
            case 25 -> a(-761071901, var9 ^ -1637533608);
            case 26 -> a(-761071902, var9 ^ -1449144468);
            case 27 -> a(-761071903, var9 ^ -2003632387);
            case 28 -> a(-761071904, var9 ^ -911920380);
            case 29 -> a(-761071897, var9 ^ -1150917066);
            case 30 -> a(-761071898, var9 ^ 524691994);
            case 31 -> a(-761071899, var9 ^ -105315698);
            case 32 -> a(-761071900, var9 ^ -1098431988);
            case 33 -> a(-761071877, var9 ^ -766513360);
            case 34 -> a(-761071878, var9 ^ 1279804120);
            case 35 -> a(-761071879, var9 ^ 1378388362);
            case 36 -> a(-761071880, var9 ^ 892155982);
            case 37 -> a(-761071873, var9 ^ -2117993836);
            case 38 -> a(-761071874, var9 ^ 1087568941);
            case 39 -> a(-761071875, var9 ^ -358944426);
            case 40 -> a(-761071876, var9 ^ 617680468);
            case 41 -> a(-761071885, var9 ^ 56598537);
            case 42 -> a(-761071886, var9 ^ -837187552);
            case 43 -> a(-761071887, var9 ^ -536454231);
            case 44 -> a(-761071888, var9 ^ -305594560);
            case 45 -> a(-761071881, var9 ^ 606554486);
            case 46 -> a(-761071882, var9 ^ 481825456);
            case 47 -> a(-761071883, var9 ^ -1630227304);
            case 48 -> 5;
            case 49 -> a(-761071884, var9 ^ -1281492015);
            case 50 -> a(-761071989, var9 ^ 1676869660);
            case 51 -> a(-761071990, var9 ^ 494580321);
            case 52 -> a(-761071991, var9 ^ -742359208);
            case 53 -> a(-761071992, var9 ^ -1848216309);
            case 54 -> a(-761071985, var9 ^ 1288295639);
            case 55 -> a(-761071986, var9 ^ -326026642);
            case 56 -> a(-761071987, var9 ^ 494947700);
            case 57 -> a(-761071988, var9 ^ -1168928721);
            case 58 -> a(-761071997, var9 ^ 982978051);
            case 59 -> a(-761071998, var9 ^ 49439431);
            case 60 -> a(-761071999, var9 ^ -722396069);
            case 61 -> a(-761072000, var9 ^ 622516946);
            case 62 -> a(-761071993, var9 ^ 968498085);
            case 63 -> a(-761071994, var9 ^ 1187835430);
            case 64 -> a(-761071995, var9 ^ 2140737802);
            case 65 -> a(-761071996, var9 ^ 330102624);
            case 66 -> a(-761071973, var9 ^ 1085508233);
            case 67 -> a(-761071974, var9 ^ -1575201071);
            case 68 -> a(-761071975, var9 ^ 1470790865);
            case 69 -> a(-761071976, var9 ^ -646692558);
            case 70 -> a(-761071969, var9 ^ -200301999);
            case 71 -> a(-761071970, var9 ^ -1207073339);
            case 72 -> a(-761071971, var9 ^ 1140467517);
            case 73 -> a(-761071972, var9 ^ 1089128522);
            case 74 -> a(-761071981, var9 ^ 1687230013);
            case 75 -> a(-761071982, var9 ^ 1644105384);
            case 76 -> a(-761071983, var9 ^ -1134706618);
            case 77 -> a(-761071984, var9 ^ 1676863162);
            case 78 -> a(-761071977, var9 ^ -1307369399);
            case 79 -> a(-761071978, var9 ^ 1274916993);
            case 80 -> a(-761071979, var9 ^ -1281089546);
            case 81 -> a(-761071980, var9 ^ 654659673);
            case 82 -> a(-761071957, var9 ^ 384969001);
            case 83 -> a(-761071958, var9 ^ -298279250);
            case 84 -> a(-761071959, var9 ^ -617162135);
            case 85 -> a(-761071960, var9 ^ 1640054453);
            case 86 -> a(-761071953, var9 ^ -1539769777);
            case 87 -> a(-761071954, var9 ^ 298004734);
            case 88 -> a(-761071955, var9 ^ -785243572);
            case 89 -> a(-761071956, var9 ^ -632604944);
            case 90 -> a(-761071965, var9 ^ -997579133);
            case 91 -> a(-761071966, var9 ^ 928037400);
            case 92 -> a(-761071967, var9 ^ 1882476129);
            case 93 -> a(-761071968, var9 ^ -191526096);
            case 94 -> a(-761071961, var9 ^ -513911120);
            case 95 -> a(-761071962, var9 ^ 849273095);
            case 96 -> a(-761071963, var9 ^ -1457379569);
            case 97 -> a(-761071964, var9 ^ 267344823);
            case 98 -> a(-761071941, var9 ^ -836263799);
            case 99 -> a(-761071942, var9 ^ 1829260418);
            case 100 -> a(-761071943, var9 ^ 768769914);
            case 101 -> a(-761071944, var9 ^ 1397153123);
            case 102 -> a(-761071937, var9 ^ -1215889244);
            case 103 -> a(-761071938, var9 ^ -736361552);
            case 104 -> a(-761071939, var9 ^ 349977751);
            case 105 -> a(-761071940, var9 ^ 2076081786);
            case 106 -> a(-761071949, var9 ^ 997272496);
            case 107 -> a(-761071950, var9 ^ -415508926);
            case 108 -> a(-761071951, var9 ^ -598266528);
            case 109 -> a(-761071952, var9 ^ 1351042154);
            case 110 -> a(-761071945, var9 ^ -1309610634);
            case 111 -> a(-761071946, var9 ^ -5132588);
            case 112 -> a(-761071947, var9 ^ -421578622);
            case 113 -> a(-761071948, var9 ^ 1242373543);
            case 114 -> a(-761072053, var9 ^ 99286382);
            case 115 -> a(-761072054, var9 ^ 1221901446);
            case 116 -> a(-761072055, var9 ^ -934097977);
            case 117 -> a(-761072056, var9 ^ 1790913813);
            case 118 -> a(-761072049, var9 ^ -42565559);
            case 119 -> a(-761072050, var9 ^ -1907433417);
            case 120 -> a(-761072051, var9 ^ -1705893142);
            case 121 -> a(-761072052, var9 ^ -1490081650);
            case 122 -> a(-761072061, var9 ^ 474575633);
            case 123 -> a(-761072062, var9 ^ -1123345678);
            case 124 -> a(-761072063, var9 ^ 681054403);
            case 125 -> a(-761072064, var9 ^ -673201311);
            case 126 -> a(-761072057, var9 ^ -630191614);
            case 127 -> a(-761072058, var9 ^ -1520027982);
            case 128 -> a(-761072059, var9 ^ 1489416352);
            case 129 -> a(-761072060, var9 ^ 1098017314);
            case 130 -> a(-761072037, var9 ^ -1663455442);
            case 131 -> 0;
            case 132 -> a(-761072038, var9 ^ -2090371038);
            case 133 -> a(-761072039, var9 ^ 1056989004);
            case 134 -> a(-761072040, var9 ^ -1331813984);
            case 135 -> a(-761072033, var9 ^ -855629924);
            case 136 -> a(-761072034, var9 ^ 994133679);
            case 137 -> a(-761072035, var9 ^ -34231074);
            case 138 -> a(-761072036, var9 ^ -1342192287);
            case 139 -> a(-761072045, var9 ^ -961140945);
            case 140 -> a(-761072046, var9 ^ 150431772);
            case 141 -> a(-761072047, var9 ^ -68226622);
            case 142 -> a(-761072048, var9 ^ -1451192730);
            case 143 -> a(-761072041, var9 ^ -1926357913);
            case 144 -> a(-761072042, var9 ^ -682258923);
            case 145 -> a(-761072043, var9 ^ -685111017);
            case 146 -> a(-761072044, var9 ^ 2085934379);
            case 147 -> a(-761072021, var9 ^ -1903591327);
            case 148 -> a(-761072022, var9 ^ 1885479620);
            case 149 -> a(-761072023, var9 ^ 1427662153);
            case 150 -> a(-761072024, var9 ^ 1378548036);
            case 151 -> a(-761072017, var9 ^ 12306270);
            case 152 -> a(-761072018, var9 ^ 574627432);
            case 153 -> a(-761072019, var9 ^ -763645816);
            case 154 -> a(-761072020, var9 ^ 1415479906);
            case 155 -> a(-761072029, var9 ^ 255330143);
            case 156 -> a(-761072030, var9 ^ -1877522674);
            case 157 -> a(-761072031, var9 ^ 554902463);
            case 158 -> a(-761072032, var9 ^ 523345199);
            case 159 -> a(-761072025, var9 ^ -771705993);
            case 160 -> a(-761072026, var9 ^ 1690757616);
            case 161 -> a(-761072027, var9 ^ 1397177086);
            case 162 -> a(-761072028, var9 ^ 1870770558);
            case 163 -> a(-761072005, var9 ^ -791549919);
            case 164 -> a(-761072006, var9 ^ -1805655528);
            case 165 -> 3;
            case 166 -> a(-761072007, var9 ^ 662073249);
            case 167 -> a(-761072008, var9 ^ -1980165783);
            case 168 -> a(-761072001, var9 ^ -1932623573);
            case 169 -> a(-761072002, var9 ^ 50183478);
            case 170 -> a(-761072003, var9 ^ -614358423);
            case 171 -> a(-761072004, var9 ^ 962776149);
            case 172 -> a(-761072013, var9 ^ 1063836119);
            case 173 -> a(-761072014, var9 ^ 921198401);
            case 174 -> a(-761072015, var9 ^ -1170387477);
            case 175 -> a(-761072016, var9 ^ 1274037175);
            case 176 -> a(-761072009, var9 ^ 1913929412);
            case 177 -> a(-761072010, var9 ^ 532627545);
            case 178 -> a(-761072011, var9 ^ -1375438063);
            case 179 -> a(-761072012, var9 ^ 298036955);
            case 180 -> a(-761072117, var9 ^ 18019728);
            case 181 -> a(-761072118, var9 ^ -220066490);
            case 182 -> a(-761072119, var9 ^ 1747221921);
            case 183 -> a(-761072120, var9 ^ -1250706988);
            case 184 -> a(-761072113, var9 ^ -673886907);
            case 185 -> a(-761072114, var9 ^ 365782985);
            case 186 -> a(-761072115, var9 ^ 1791978334);
            case 187 -> a(-761072116, var9 ^ 1461740991);
            case 188 -> a(-761072125, var9 ^ 1865821032);
            case 189 -> a(-761072126, var9 ^ -462417599);
            case 190 -> a(-761072127, var9 ^ -1207296448);
            case 191 -> a(-761072128, var9 ^ -1032278555);
            case 192 -> a(-761072121, var9 ^ -970534792);
            case 193 -> a(-761072122, var9 ^ -1379156913);
            case 194 -> a(-761072123, var9 ^ -2146643344);
            case 195 -> a(-761072124, var9 ^ -1673278888);
            case 196 -> a(-761072101, var9 ^ 65317176);
            case 197 -> a(-761072102, var9 ^ 508452354);
            case 198 -> a(-761072103, var9 ^ -1505809103);
            case 199 -> a(-761072104, var9 ^ 1098948679);
            case 200 -> a(-761072097, var9 ^ -8886026);
            case 201 -> a(-761072098, var9 ^ 792935480);
            case 202 -> a(-761072099, var9 ^ -854417836);
            case 203 -> a(-761072100, var9 ^ 1906916861);
            case 204 -> a(-761072109, var9 ^ -540623119);
            case 205 -> a(-761072110, var9 ^ 1673733560);
            case 206 -> a(-761072111, var9 ^ 2019769441);
            case 207 -> a(-761072112, var9 ^ 527310386);
            case 208 -> a(-761072105, var9 ^ 1435822446);
            case 209 -> a(-761072106, var9 ^ 1568770927);
            case 210 -> a(-761072107, var9 ^ 1631879480);
            case 211 -> a(-761072108, var9 ^ 1434983889);
            case 212 -> a(-761072085, var9 ^ 1673635044);
            case 213 -> a(-761072086, var9 ^ -1037420669);
            case 214 -> a(-761072087, var9 ^ 766039592);
            case 215 -> a(-761072088, var9 ^ 1312901023);
            case 216 -> a(-761072081, var9 ^ -1779721479);
            case 217 -> a(-761072082, var9 ^ 216905520);
            case 218 -> 1;
            case 219 -> a(-761072083, var9 ^ 1572534179);
            case 220 -> a(-761072084, var9 ^ -873375384);
            case 221 -> a(-761072093, var9 ^ -1119216795);
            case 222 -> a(-761072094, var9 ^ -490152393);
            case 223 -> a(-761072095, var9 ^ 1393561145);
            case 224 -> a(-761072096, var9 ^ -2031594222);
            case 225 -> a(-761072089, var9 ^ -1820833668);
            case 226 -> a(-761072090, var9 ^ -1199377327);
            case 227 -> a(-761072091, var9 ^ -283708991);
            case 228 -> a(-761072092, var9 ^ 1999245705);
            case 229 -> a(-761072069, var9 ^ -355501828);
            case 230 -> a(-761072070, var9 ^ 2129613155);
            case 231 -> a(-761072071, var9 ^ 1588450539);
            case 232 -> a(-761072072, var9 ^ 1769723463);
            case 233 -> a(-761072065, var9 ^ -2031395394);
            case 234 -> a(-761072066, var9 ^ 583840663);
            case 235 -> a(-761072067, var9 ^ 1737261301);
            case 236 -> a(-761072068, var9 ^ 1161182988);
            case 237 -> a(-761072077, var9 ^ -1971798801);
            case 238 -> a(-761072078, var9 ^ -952292531);
            case 239 -> a(-761072079, var9 ^ 546584968);
            case 240 -> a(-761072080, var9 ^ 1609301980);
            case 241 -> 2;
            case 242 -> a(-761072073, var9 ^ 762716964);
            case 243 -> a(-761072074, var9 ^ 2142437485);
            case 244 -> a(-761072075, var9 ^ -356663361);
            case 245 -> a(-761072076, var9 ^ -908305228);
            case 246 -> a(-761071669, var9 ^ 133131993);
            case 247 -> a(-761071670, var9 ^ -1812839015);
            case 248 -> a(-761071671, var9 ^ -1048147489);
            case 249 -> a(-761071672, var9 ^ 1826556918);
            case 250 -> a(-761071665, var9 ^ 1967238495);
            case 251 -> a(-761071666, var9 ^ 527876886);
            case 252 -> a(-761071667, var9 ^ -1543892744);
            case 253 -> a(-761071668, var9 ^ -1225477587);
            case 254 -> a(-761071677, var9 ^ 2059509674);
            default -> a(-761071678, var9 ^ 332057547);
         };
         int var5 = (var1 & a(-761071679, var9 ^ -2110919404)) - var4;
         if (var5 < 0) {
            var5 += 256;
         }

         int var6 = ((var1 & a(-761071680, var9 ^ 1809412072)) >>> a(-761071673, var9 ^ -1345167007)) - var4;
         if (var6 < 0) {
            var6 += 256;
         }

         for (int var7 = 0; var7 < var3.length; var7++) {
            int var8 = var7 % 2;
            char var10002 = var3[var7];
            if (var8 == 0) {
               var3[var7] = (char)(var10002 ^ var5);
               var5 = ((var5 >>> 3 | var5 << 5) ^ var3[var7]) & a(-761071674, var9 ^ 1374823166);
            } else {
               var3[var7] = (char)(var10002 ^ var6);
               var6 = ((var6 >>> 3 | var6 << 5) ^ var3[var7]) & a(-761071675, var9 ^ -788373416);
            }
         }

         aa[var2] = new String(var3).intern();
      }

      return aa[var2];
   }
}
