package nsc;

import java.awt.Color;
import net.fabricmc.api.EnvType;
import net.fabricmc.api.Environment;

@Environment(EnvType.CLIENT)
public enum babaabb implements bbaabba {
   public static final babaabb aa;
   private final Color ab;
   private final Color ba;
   private static final Integer[] bb;
   public static final babaabb aaa;
   public static final babaabb aab;
   public static final babaabb aba;
   public static final babaabb abb;
   public static final babaabb baa;
   public static final babaabb bab;
   public static final babaabb bba;
   private final Color bbb;
   private static final babaabb[] aaaa;
   private final ababbbbaa aaab;
   public static final babaabb a;
   public static final babaabb aaba;
   public static final babaabb aabb;
   public static final babaabb abaa;
   public static final babaabb abab;
   private final Color abba;
   public static final babaabb b;
   public static final babaabb abbb;
   public static final babaabb baaa;
   public static final babaabb baab;
   public static final babaabb baba;
   private static final Object[] abbba;
   private final Color babb;
   public static final babaabb bbaa;
   public static final babaabb bbab;
   public static final babaabb bbba;
   public static final babaabb bbbb;
   public static final babaabb aaaaa;
   public static final babaabb aaaab;
   private static final String[] abbab;
   private final Color aaaba;
   private final Color aaabb;
   public static final babaabb aabaa;
   public static final babaabb aabab;
   private final Color aabba;
   public static final babaabb aabbb;
   private static final int[] abbaa;
   public static final babaabb abaaa;
   public static final babaabb abaab;
   private static final long[] ababa;
   public static final babaabb ababb;

   public Color b() {
      return this.aabba;
   }

   // $VF: Irreducible bytecode was duplicated to produce valid code
   static {
      int var26 = -2100893681;
      short var15 = 10828;
      char[] var17 = "ȣ\u0011ৰ\n\u0010\n".toCharArray();
      String var16 = "洭洪洠涿洝淉浼涾淽津洊浮浚淩涷沤浏浔汎活洂测浅淨洕淺浴浇淨浌洞浹浦淩洊浝洛浳涷淠淇浉涻淡洂淰浻浂淡淑淹浩浍淪淧淼浺浦淩津洔浿浯淡洯浐浲涂淡洊淳涓涃汎浃洪涾涃淡淛浥涿泧洝淚添涉洙淛洭淼浮涏淫浾洌浻涅淤淭洀浚浔淐洟洀涽浔淭浌洈浙洭津浌浟洙浍淳浾洈浿涼淡洽浛洝洨洙洨淸涶涻涺淧淼浮涹淥浸浖泝涅涳洱洈洦浊淪淫淩洞浈洑洔派洤浇淬淙洌浉流淨洄洋泝淩淥洚洂洪浀洓济洰洧浈淈浅浣洐测淜洛洓洛洓洐淢沧涃浏淜浌洔浺浦淧浾洂洦浥淯洙淩涭涃涃洍洲浉洡洔洳浛浍涸汎洵洈浊流涴洘淹洪浄淞洊洚浲涋洀测洸海浫淩淢洆浴液洕油洮洫浻淞浅洁涃洐淭洖淀洘洚洀沺淌洡淩液洫淹涆浈淉浳洽洬浗淌淡浙涋浵淾淢洈浻浊涉洞洷涰洝淳淪浓涃涼淡淕洷洛涵淮洆洆洦洑涹淨浭浮涍洭淓浒浮消洕淡洈涱海消淯浠浢洒涵浈浥涃涼汎洵浙洛洐淽洛洨洫浵汎沺淂浱测洑洒洄浹浔深洝洦浺浆淉洒洳浱浂津洖洮洐浅淥淡淌浃浟涻浍浯涆浆浀洕洱洪洝淼油涩浴洠淬洝洀涽济淭洕洈泞洮洫洞洌浬洙淉浳浚浽涼涵洂洉洧浯涹淕洋洩浹消浲浨涸浀洚淦洔淓浅淮洑洸浑洦淋洘涩洪浇涻洜淁浼浫涹浾洋洧涍淡淚深洜浽消洳洌浛涼涼浽淼浲洘淘淝浪津浐涁洴浠洟涹洕洖淽洜洭涉津洙洨洞涰淐淼浽浔添浇洱洩洝淑洑洷浲涳洀淝洊泞涺汎浂浨浹涹洕油洭洫浵涿洊浜浩浳涁洩添涌洒汍淬洰涏浗淿洿沤涂浈洯浼洼浊洙深浰淅浌浵洟淢洆浟洑淾洐洀涰诬럜럠뒨둖둵됹讠뒨뗏讚诪됿뒘诵讖讐繁纓綨纮禾繼纏縄罨總绉綖繰纺绬綜縔縂绌縮縋繐秣罫縲繋翱縆絸繮縮繢縒縜羞繎纼緓绬羐縣縱綢罖縓縵縌繌缿禸羉翼繅绯翀绂編纄絶繞绹翻縷绳续緪羡秦祍翅繫繾纎绾繤羉翃繨縤繌禮縹繝罜离緭翏纅结绡绉秔纊练縑禦縋繴绞羞縣秘繪縣綄繼縎縶祌禺繆羨翂絹繫绔繋积线繱縻縨繐罯绝禣繗縖纽繽繆縷縬縬繱羏繺繆絶縵縖縖秪縗縇綐繥秡缷繢羀纼翇缵续縵繜繀纡縩縷縞纰縘绫縺縑繝罘縵縛纱羕縝繃縶羡纼纵縟縝縀縪纂繳羇纶縼絸统縥结纗絷翁缤繽繅绝禾繘纏縎综绪縡繎翇绚縵翕纏罤罕绠縨縎綮绾绒禧纷繪绯繇緣翲翂给繾縐綘繀縩绯縞纴繂縐繿緣翽縥给縵绱繉縍约綎緦縰縳纵縋翟縀繸縑绬縼緯縗縥縊缧纹縪纸繄繍纉縃纈络縌綞翉縗縨縴秔纶纅繨绁繈綨縜繃羌縒繣祄縣禧翋繹绡繳羆纭繭祂绣禭縡纵紆羒縩繲翶绰翎綑结繕绺縀繀繬維绷羠繨繱縥置縼縎羬翇罠羑绷翲綬绑縣繼翏織绯縰翕纵翻绽绠繙秞繭纽縙縋翁翸绚縙绗羫繾縬绦繎翽纂纘绑羁繲織縟緾绋纆纗络绷總纶纍縓縂緡纾翌纡縃羆義翋罪縆羗縜翼罬縓翐秚秨织縍縁綞繽祍繾繟繅繇纺繊羷繡縰絷禶縂翁縡绦繱繲緫緑絶縟繖繄繜缸绉绹綗緙縥绫縠繪繫绤縕縴纺綨纗繑羗翺繠縧練繻繘綠罟綃縉縃繓縛繛縹纇翾绻繫縝纳縹绞縋縻縙繈紃綀绁繇纏纲繅縒總縛纇縑績翮繰绢繱翜纵縅縀繟羊秖翋纸縋繦緣緘絴繓绉羯繒縜翁繖繸綢纰绥绾繺縤纥羞緫繋繳绤縊縴纏纋缼綌繸縟翼缰纪縦縖繶纄繨繰綕秠縐縗繎縼纱终绚繼纄綯縥繴羅繠翁缺織繹繉纄纰綍綑縼繮縗繗縩羨綤縔綁翕繿縷縪縗绔縮纵祎繀緧羡繫紇繫縵纎秭绑繝纴縈繦绤繻緪績纽縒羉縮翲繜纶禰缧纈綬纳繂繜纮縝罠繮羷繕縋纟縤縳縛繯祋禶緭繢秣祅繇禥綐繶縣羊翙翇縬縧羉羁繈秥罦翈繦繳綠紏绯繇繋縫縧綁禮縖緐绑縴繞科縶绁緾翛繧繋纳緶繣縐翗縡縱繅縚纂纠緾繉繦縣纝繚繄縥繴縬繫緪繖翳纡羡縡緣繠缹羮繲翴縹纫繰繿緢縥紅羨継翰纔缲繺翑縻繇绶翆縛繮縿绀縦縥緪續纗繅综縝緞絻翋繫翻繂纟绞縒綘緟绠繕羍繖繩给结绁翆繃纪禹縒纋緖纂繒縩纁繴絰绡繙纉翄祌羙縊緯羝绔绪繠羬纳縤羫绋繆积祅缹縲繖縑纗绢繦縘縗縧繴绽繎繙縔緸绵纄緖縀縖禭綔縏約繎繭秙纹罛翇翓纂縩約翈經繗織纞縰縒翄縡紋繁绍繄縞罠緹绾綜繚绂羥縆縅繐罞義绸翿縲縒羯绗綛繪紆翆縅繃縎縬縲羷緯繪纘縎縞翌縠翎绗綐翴繃纤繰羉羧纰罩緽羼緦縥絸縕締纼繋绢縀縉繎秤縒縫羁纅縠纬羬縿縗繏縑繬繐縮翎罚翁繝繊縴纩繇绽纶繀罟縭継翈繀罪縨终翍纅縤綃縻繿纀绊縃翝繯纄縟绚縲纍羘纝羔翙翰繿绁绮绸綕翌纖繟羿繗羛紁绠羽綜翀纯繤緤縿翺罩緰羗縦繞縓綎绵翿翍纟縑维縃纰罨縪组縱秦续绚縁縃縆绁綃繒翭纱縘縳続綟秠纡緹绉繇繥纁繠羷羯纸纙繧绗翂秧纤縁緯縳縗纀绑縗繘繢縝縔縼縴綥纡继羇縐羚縨綆经翼縝祈繿縙編繭纖縒翘纽繿纉绕繷縻纗縨繆締罞續绽繦羌縞緒纟縅绹継縡缵羙综繖秡纅緵績繕纄纱縼縭縔繡罕繢繒罞纷祏群縋羡縫缿繳綖纉繷絹禹羾羠緕縟縜繣秕纊罐繷綘羦緜罞織緪翮綨縮緹羌繫繂絳繸翖繦繈缳绘羅繥翄纄縅繘纰綣纶羢緢秔羟绀羢羄縪繕罓羛繊繥繿縛縨绉綟繒绨綍翘繧线纹翌縬縴纅縦羐縕緦翇縤繱羾繛綠纒繛繌繑繍縠縨編縛縶罠縱緣縏纏罫繝绹縅纰续縆縻翳繅纊繸繳纏翀绶羫绾纂繪罟绨縱緫秥缻綈緪繚纰绵縦縏翏羒絸禾縚義纆绷縍绎縹纅纨繡繪纅秦紏縴繎縫縐置縵縹綞緟纝羧绌纺縿纁翇羄緫縟纇繯繨綐縌纫翅繢繙翵紌绩繥繶翅繀綋繝緯縡绐绖繣羡秮罟禳绲繑秧祈绕羗縌織祇縧缤翄翽纎縻綕綟绩祁繣绁縻縚网繘緥翺繁绮縡综繵縖祆縦翖纮羓翎繽羈繙纼纠缺羺繳纉縙绦縌翀繐縩緺织翉翸纘禾绁繤翋纪繧縁綐纈縬縇绁縖纀绨縈绊繨縷纤縉繘纰縪纵绕縞翉秣縖縊禭縪繰网羗綛纍縨祈繙縆羫縴纔繻羉縢繀罘縊禤翮翹縣繿繈罞翊祊縎編縀縙纺繙繅纷緑紋綍繻綖綦祈繅縰縱繐纷繏縆義翌纘縶绎羨縢絳绖縶繜纷纜縙羵縮翵继羭羷綟縀纬縩繴綞縏纁羥繈繮綮绑翁繀秖羖络繥美縊繦罣義翐縁秧细繰羊翊縯祈緸羏縇繒罔繌羶繐纎績縈縆科翾纠綁繢縕緒绻緾终綛縑纸緶縔翄縤紂绥绵縄繀绹縇繘翵翶纯縆绔繙繼祍绦縏縯羜绘繼繋纻縅紋繩繤縤翼缰繰繩繒繁縑績绱綕繪罪禺翞縱縡纶縧禣翊秮縬统緪纸翉绫结縼纸翍纎縵緡纍绩罦縱繌科緖绹練组縻縗纆繩羃綘縕絲繆繴繧纾祈禵繀翾縿纕縣禧縿翱祅绡羲繢縞结繙縫縘縠祊绡绩结縡絰緸繯縿羘纱緼绳縤纁縓縍繽縫繮纈繅绺纇秣紎繲縑繼繡纵繊繇繪翼祉繳繵秔翹纭羔羱縐秤置禼绽线羙絳縘羗縦縏縀緼维義縫罽羖縙纵縒绯绦縵秜縂罬縨繐线繹绻綏經繑縢紇縛繺纆秥罽繧绰縎繺缻繼緮翃纾纫綍繡秜繴罫羑禣繎綮縓绠翖緫纏罕缺緫續羐縯繜綛羬縻纝羛翓縛縬纜绨繤績總维翍繮秖繭绻繡縟秙羙纝羢縩纀绩繀繝绎翻繻绔縆羍纹繶绸羦織繥翼纬繲繑翿縓给緸縁纶繶缵禵縙縉翶绥織縝縑纳紇縓羆繉翲纽緹羺纽羐绩縐縺縑翀绗羒縱繉縨组禽縇繑縸縬緿禣縑繖纗繗繞繓緞罠繢縎纁縸纁縇縦群纸绔緶縻纵纔縔繴繯緧縨绝羒羍綖翹罙繥繞縴繐罠繺繾綒縆绗繞繙縊縃纡綇綕繊縔縛縭繠纍纔翍绬繻群繼纾羖続綖纻絹繶繗繇纏绹繗羅繊秥祃練绩秜纹罕繊緤翃纂缵绘经繒翔纟繨繋翍纀縟绢縠繁緖纄縪繸绎羕縓縭繫縹繞纑縙绻秕纶纡縡績纱秥縧羣繁縪翈统禽羊縲縬绾绷縨綜緓纳翋绸繀秪缿翅縴繠縟絻统縩繗翊缳绷緮繓縳绖绛縮翴綤罨禳禮緫繝绋繓繞繬緐纝縵縦縌繀縚禺縯縰繈祈羧羾繾綬縚繨緬縨羚祌繇禨縋繷绷羕綑縝翷纵繦繫繮纼纗繸繽縆翶绦繢繥纊纺绿績绔繜縃纀縆禮结縙绮繨羸縜繱纤绨縙科维紏羟綑継羞纓繱羌繉縝纤繓縁繳翰绲禹縣繛縱絰绑緢綒翊纽离绳线羒纂绕織羧羟罦繽禮縄繥繀繶繾秔繗祂羥繌繸繪纞繀繊緯羚纋绐羶繾繍缵緾縓縨繦罓縈综纅纰纺翎繫繢縼纺绉羲纲緟绔羚縪繟縔纋縡縛縸繶祁绥縅租綮縟縴縮纶繐祄翋禪秚縶红縈縍繣繍线羟羻縗綬细羣綜縓翸罜翆繐繚纁绘縏縪縜繘纊繐繼羨繲缶綏繺羯纔罾緺縴纱縅纞縎繒繤繋经縬羃纴繯紃禸繬縀翍纷縆绂綝秨绳綍習繌翀置繥縍縶秬绕縜绵縒繲罗绗編羫秡紉緳繨縖秫罠禲繉綟繪缺绑繊繵翾绉縻縌秘繑紉绉翛繲縬绉縛绂縁繶罤繅綕绎縥纒绛繪翻罧縪縦羋秔纔纍繳繕緩翾祉縤绋繎縋绋繠羊綘纅祁緱繩纳縋罐绤緢綜纂绒绩绌繄縙罐繍繟繸纏縀縩羋翆羖絻繅繡秖繋纸繭縮羨翆纩翏羆縩繋绞繊羔翲繶絳繎繫纋秭紂绔羃翱纳罛羟縐縑繨绩绕縪繶繐绝羞繺繙綪罖羘縹羢繹紋縡羆繈縨罾緲繶纱縦绸縘總纉維绢羯綑纮秣纝綄繿纭維罚绗縞繃繉絰繸緣繇綣縠绕縞纷繁绦绘经縕羐祄繉緣縹縳罞羮羁繭翌纓羊禭縑縼纥繌縙羫縈绌綏禬纼翱纯綆縊纷綥缳綆绀縃繜縯繮禧繶緙缹縉绍縮縬絻縚羔翼翿绞繙繥纷縚绋繊繚縼翱缺绥翕繱纍祊绦縗羪羒纹繘緬繰纊纩縬羳綒緜绌繷繀繉繂罕繣练纍翆练繺羳繿繌线禰縞綗羜绶괪궆굨귧굇굙괬괚귧굌㶓㶚㿿㿍㸄㾍㹧㹑㻭㹹㹥㺭㺈㻼㸉㾰粿犟糹牲獖獈猹猏牲狹";
      byte var22 = -1;
      String[] var18 = new String[var17.length];

      while (true) {
         int var19 = 0;
         char var20 = 0;
         char var21 = '\u0000';
         if (var22 == 0) {
            abbab = var18;
            abbba = new Object[var18.length];
            byte var31 = 0;
            int var10001 = 0;
            abbaa = new int[794];
            byte[] var10002 = "\u009c\u0095¥Èfj{]¼¶úzk<¥(^¡eD\u001e÷ô<zðû«Eh¦Ù\nÎÖq\u0006ìPzÆ½Ù9BnMaHr\u009d\u0084\u007fGz1¢8h+\u0005Ýa,²\u008dÖRMO\u0013\u0016\"óÀ\u001d\u0084\u000f)~\u0019\r¢í¸Û7sdsÃÅ5?ünY?ªÉv\u0012fî\u0019$\tf\u0091\u0004Á\"\u008f\u0090ÚX¹¾.²ø\u001bGµZIÿc8}(g\u001fÓ\u0091ì_u¢oF º\u0019ÔI²6ò\u008e;a8l\u0090\u0086b\u0099\u0004Ô\u0015íp\u0081\u0095¢j\u00908X\u001er*r\u001cn\u001d\u0016¤ä¼\u0098\u0005\u0002l-N\u00ad¨\u0086\u0095 ¥°JáôËVþ\u0098»l39\u0088t¢¿=\u000bF!<m2\u0082Å#\u0082=&\\\u001aÂ4\u008a´\fßæÆR` lDodÁE0VVý¼´r?\"#á¯êÅänz\u009f\u001dÝlRhF¢ß\u0005üÝõY\u0010VhÀr\u0018÷\u001e³Á{6ÖÍcìÂ¤Å{NÎD×¦ÐÆlQPyëöÙI\u001dåh>Î/\bð«¼\u000fÉîÍ\\)Ñì«T\u0090ãR)ME\u0010÷\u0097Q<rA(»7¸¤ºá\"C\u0010¦Gm¢01o¥(O\u0086\u0015ãzÔ¹î0ö}\u0018Õ\u0018Òy\u0011o\u0017ó\u0096ËT\u009awÐZä7C\u0013¯lZxxQ\u0080\u0018}ÏÄ_ç\u000f¿2HÜ\f!¶#\u001a~Ä\u0004`Ñ¨w\u0087uYýxa\u00ad\u0091µ£«p-\u008fu}\u0002\u0001\u00030Ö/\u0096cò\r\u0003\u0086>{7\u008az/\u0007jW¹\u0097\u001bW\u0096EÙ\u001d\u008fë#Óº³F.\u00007\rÿQÎ\u0083¥¬;Ëré\u009dq\u0098ÙY\u0090½M\u0088\u00835è®°}\u0004Ìk¼&\u009dm`¿ºüª\u000e\u008b\u001aßVeÈ³\u0095¦x¢\u00adTà\u009fÅhô\u0093\u0080j/\u0004l\u0099S{ø\u0001oä7:¾MÌ\u0000ÁÑn¬\u001c\u0086\u009e\u0010Ýgb¨*k\u0005,F£\u0089î:®Þ\u001e\u009d¥()\f×\u0002\u001cêó{h8\u0011u/·\u001c\u007fã\u008d\u0016úS\n1Ø6²\r\u0087\u008aôvvó99g\u008b\bSH{C¡\u000bàÇ\u0089ÊA%ê®+%ïRH°7ÐÒ\u0006ù%ßøÕªÎeÂ°\u0001ÎoÙ\u0014Ó]J8ãM\u0003/Y\u009a.D\u000b\u0010»\u008f\u009b4±^Pºbuè.RX×\u008bº\u001c|GI\u0015\u0002°m\u009eÂU\u009b;Ô\u0004\u0011º\u009a\u0011VúE\t\u009b%Mu\"MKû\u008e\u0092î\u0086ÝS+xæéD×¯\u009bÆ\u0091j:\u0002ð\u009fj«®\u0080ð\u008e°3¥P83À%Ú\u0019ËÑ:y\u0012\u0093OÁ:\u0011\u009a²¢I\u0094s1\u0090\u009dëò\u008dBì'.»ý>þ\u0012\u0019\u0092ªM\u0099p°æ\u0090fa_Ë\u00192Ë@¹º\u0086\ryÃYGõ%ì\u0083#gG*ÿ\u0080xÁ<Í\n\u0082H\u0094ï_.ÿá±¼\u0094´;JÙk\u009b\u0094\u001dÊÕ\u0018\u0082\u001fOð¨Ä\u0019Îñ¾Sº°ºæÇjÑÔÝ¸9ëè©\u0000\u0094Î8\u0086L\u0086íUÃ\u009añWöoõ¯»sSíSq(B½T9\u000f\u001e2\u000b©\u009b)\u0012£\u001c\u0092YûàKU\u009dÒáÄÉ\u000e\u0007¨C$#\u0094Ö»\u0088I\u0005\u0080\u000fÓ\nqC5¥Ä¤)s Ñ\u007fªÒ\"\u0001T\u0085\u0014v³î\u000böNê\u0091\u001b\u0007\u008d\u0080þþ(,,YrË7(vt,ñJyìNØ\u001c\u0012XêLWê\u0014¨\t£×*\u0002Âk\u009f\u0016ãÏZ0tìêG\u0005ôV[\u0001\u0083^\"\u00958\u0099\u0014¨\u0014o\u0087ÂoT\u008c*°\u001f1Üý\u0005{Í\u0090\u00815\u0017ÀW\u000e¡Õ\rUóxy\u0003¡û\u0003J\u000e\u0017u\u001aâ©ö\u0019xl\u000e\u0016\u008f\u0014¸\u0086=\nôÖ2f\u0089*¸\u0084ö¡\u001fñÎklëò\u0007\u0001]¢ø¥$}Ij·\u0089¢`Îü-ÃßÏþ\u0080ä¾\u0017\u001d\u009e\u0083\u008b\u001a}\u0013È5ÏßYÆ\u0001\u00adDûä|\u0001\u000f\"\u0090Ê\u0085\u007f>\u0099\u0007¬\u0087è_}\u001a±¸\u000eW)\u0018\u009f\u000bËC\f\fÄÊ\u0010EsC\u0016v®ÑQ\u009f\b\u0095¦¯DÛºäÃ.\u0014A\u009fÆ\u0088,OMÀghÐ¦Ï>Ôkz\u0088ç=Û'\u009a\u0007onIÇOØÁ`ZÞ2c0À\u0005b*\u0098A\u009eÿv¤\u0016p|Ø¤¾6sç\u0006pí!wØ£ÅÇ/äZ½~VQ°´÷ª\u0085\f\u001c§Ò[\u0012ÊÔ\u00132)\u0017å\nD\u0002\u0013U%Ï\u0004mr°»\u009c\u0084¥\u0080<µ\u0015Åb\u008b[|\nuô\u0018\u009fGØ3+æÈ¹\u008b4ÜÓ¾\u0018¢õ2¸î-R¹gúxw\u0013~Iÿ§\u009a¹8³\u0011Î+«©®0Î\u0082^\u0097aøã\u001bàÈO·n\u001b©\u0099W\tÝ¦\u001b\u00180rSó\u0089\u008c¡ ¯d]\u008dÐÅP\u0011\fa)|ñ'\u001cüÎN?Ì\u0091\u001e\u0091W'\u0094ÎÖÕFü\u0018Á\u0093\u0017w½äâÌ\u0086*]\u000fd\u0089H6\rgOÆ`\u008c}\"ª\u0006\u008aÕA\u000eÉÝgqBËÀ\"újP§45\u001b+5\b\u0094Ê*GyÑ\u008e§}Ê\u0084ân\u0004î\u009a\u000f$Ù_åô,TÇvaá×I\u0014\u009d\u000e3$º»óæ,+/%8Nl\u009aÇ\u0095Ö\u0012É8ü/æ`ù\u001c\u0017Mf\u0091ºã~\u0090=|ëE\u001dl|u\u009f\u0081\u000bñ\u0000Ê'÷%?õ\u0014Y§\u0017\t\u0085ºæ\u0094m\u0013¡YµÅüc\u0019\u008dfÒPSü\u008fò\fQ\u008a½\u000eµ=´Ã¯úZO\u00988g¤U\"ª\u009d6\u0006ÒaIì8ÜMLUès Q\u0082 \u009c¦\u0085b\nTß\u008aï'\u000f`\u0004cº\u0096í¼@¨óFdCþj}\u0002 ¡ºm$Vf\fR\u0015Ä\u0004ëâÊLF\u008eî»â¥\u009c\u008a)\bîæß¸\u008a\u007fÊ]PÂ\u0013\u0088|ÿ\u0005>{\u001bP¬\u000b³#\u0086\u0013()ïSú7\u001c3»!F\u0010#û@\u008d\u008a¾\u0002ðÒ=e_î5\u0013°\u007f4\\å\u009b²Èë\u009cÒtö+Ã\u000b\u009c\u0014òpÒ¤ðR\u0083\u0085\u000bZMOé\n\u008d\u008c\u009ac;ç\tæ\u0017qÏÞø®¬ ]Ú\u0003\u0084¼\u008fäW/$QU\u0015\u001dhaò\u0093|âý`\u0000Y_\u008b3ð 1Û õ°´Æú¯-\u0006¸Øör§i*Dö{Y\u008a\u0089pzAõ\u0092yò.~\u0018àóvº¥\u0005;mûô\u0007\u0012þ¦Ö¦,\u000bÎÅ\u0081ãÜñ\u0010Å;è\u0000zuígjÕ\u008dw}¨5\u008c\rÀÛ\u0002\u00ad)\nñ\u0017ùÔÄ\u0085#Ô)\u0014$ÊÂDb\u000e+\\I_\u0007j5³\\ù¿áðõ`-á\u0002Cùñ\u000f\u0005C)Ò\u0085\u0005\t\nJ\u001f\u008eþ\u008a'ä\u008dy YØ;õý£\u007fN+×ÓðWFßÚýV|JyÌF9Ãï4\u001aÕ\u0099O°\u009d@\u000fWÒÕ¡4°\u008d\u007f\u000bÏÍ{«1r\u008e\u0095³\u009dE^g{ç\u0004]\u0083ÁJë\u008c\u000exõÖÁ¯vza¸½éÜÒo\u0004\u008eUU\n\u008frÞÊ\u0013ò5):;¹ü\u0006¸¬ \u0082£¡çp\u0094\u0090ó¹4\\ys((\fÕíN!]\u007fC±ï«ËßtÒ\u0017¡r\b\u0092o\u0012\u009b4À·q\u001e9ÿ\u009dµóLW\u0086\r\u0082¥gà\u0013òÙÝ\u0006\u0092ý+¶\u009a\u0015X\u009b@÷Pb\u0093ã\u0017ò\u0083Ü\u00adx§\u0014²\u0091çÒmÖð\u0013}\u008e\u008f\r{á=Uæ\u0001\fW²\u0013¶ZU\b³\u0016[g§\u008dÜ\u0013Ìit\btgÙÇu\u001ae·\nÉÌûB¥\u0014/\u009e+ôV\u00806\u0018O\u0011¢QùuD¢Í\u008e\u0085ÂÆ\u008aõ8Ö\u0093\u001c°üÊX+sl)]ávóáæÐàõ2Ñ9äI\u008f/»Äs±ÿH,v÷O[²s\u0082¤¼ô\b/Ä\u009av\u008a1y!N§LZ²\u000bw\u009dà8r)K#\u00ad²1z~\u001fÝ\u0018x\u001eQß\u0094-\u009a\u0084ÓZ\u0094\u0089!è×\u008cLl«\u0093\u0086]\u001b \u0016¤\n\u0012<d=1\u009b×DYÛ\u0018~\u0098¯z÷QÅ?æÑ\u001e\u008fñ ç3¡2ðü¼Sy\u000by\bg\u008f²>y:õG\u0011ES£\u0081Ýc·0«°=S\u0092~\u001c\u0098KZ÷\u009dM^³Å\u0086_ÔÅ\u009dåµùb1\u0093Ö\rîï\u0011ßs\u0007kj®¿IxhÕý=,ã8Q\u0087\u0012jÔâ´·Ù#\u0087æ+Ñèå7r\u001f?\u001a\fæ\u0097\u008eÏU´êSl¼°Ä\u008d\u0017K]\u001cI\u001a§5þ{üüÙÿ ¨ùLø\u0097Ò¥÷\u0083LVØ¢\n\tFÜQv¼\u0014\u0087§ÉÍ%üÂ\u0013C\u0096\u008c\u0017+Q7¦åæ°SúìúN\u0091\u001d¾ÃÖ²ÂØMR$Wú\u007f.\u0003&½:\u0013QD\u0003\u001b\u0003øXð\u001bÐÀá-\u0091S\u0089[´\u0014òO\u0013;ÁÏ\u009d\n\u0082\u0082&\u0098©\u008b\u0086°A\"áÛI»ô«ùÖ£\u001aï\u001bp \u0010\b\u001cBËöÔz\u0089]ö¿øÞ\u0082¼P¯æ\"GÏ\bó\u001c\u0083Îh\u008b\u008dF¢\u0007J\b[\u000e\u0002Tð¢\u0094\u0093BM5Üò©y ÔIX¦ÞF\u0006/ßàäèa\u0085·\u001c\u001f\u0004¡LL\u0016Ê\u001aòÐ-\u0014Û¶SO\u0097ÙQV&ÅåL\u00968ÉJ\n\u0084Ð¡\u001aºÂÛ\u0082V\u0087Ë±\u0097 ]ñB;\u009bÒaûëïn\u001cp¿JÁQM_mªIû\u00151\u0003Z\u0094¸Äñ/Y\u008e¬~m\"9]ä\u0000èd\u001bÃ\u0006Ú¢;I\fâ, ó2á\"{t[~\u009dI ®å\u008c\u0089\u0003üÉßãÜÀ%«\u0096¶À-ÉÑy\rå\u0085Û\f\u0011BwFÁÆÍ\u0085\u0006¸ \u001d\u009c\u009a\u009b\u009afðAÄt\u000bøçfÓ\u009ctN)\u0087ú&l#âÀÖ¦1\u0012¡}%GæS\u000bHç\b-õ©\u0014yVÂR\\\u000fíF\u0005\u0016\u0092s\u0090ß¶oli\u0006Ó\u0005B\u008eÁê¢SÏó|u\fÀ\u0081.ëtßW(O*a\u009cÒ]Óþ3ù^@\u0092)\nÞñâ\u0092t%\u0095ª\f\u001e\u0001ßl*¢aúò\u000eTA@\u0015}ö(¥º\u0099m&´\u0017në\u0093øé\u0006Â³\u008b\u001a\u0092L\u0005\u0012Å«æ¡D¿¼³H\u0006q&Î¹ý3çêôzÊ0ð\u001a¯>îI\u0003v¹uÛ\u008eX«ý\u009a6\u0086-ì¯g¯;é\u0011\u008fV\u0013¯ÀN¿-ØÚÍµ\u009e\u00adåêyåcÞÏËÀ]H¯×Æ\u009c³\u008c\u0087H\bÏÏÕ´&\u0000\u0002ýð)`½ÞZ\u0018{*\u0097v\u000be4à&.çA\u0081Óò3BÌKÊOl\u0010\t\u0085\u0095c\u0004¶\u0084äm§mè|Æâ9ó;b¹\u0013\u00127´U\u001e¼\u0003E¾æ\u0002jÏ\u0016?z\r\u0091\u0004q_\u0085\u0019beL\u0089F¿º¯òÍX\u0002\u0002\u001bÆ\rYé\"\u001b)4.ÅM9\u0085q\u0013¥>Ã\u0084DÚ/àc\u0087\u0006!ömü\u0019\u009fIUgã±ne^ÕA\u009dö©\u001e×\rÓ@X\u0002nõg¶.p~\u0090Í\u0001\b¿zT\u0090éê.Ò_õÌó\u001d "
               .getBytes("ISO-8859-1");

            int var78;
            do {
               abbaa[var31] = (
                     (var10002[var10001] & 255) << 24
                        | (var10002[var10001 + 1] & 255) << 16
                        | (var10002[var10001 + 2] & 255) << 8
                        | var10002[var10001 + 3] & 255
                  )
                  ^ 257549432;
               var31 += 1;
               var78 = var10001 + 4;
               var10001 += 4;
            } while (var78 < var10002.length);

            String[] var8 = new String[a(1228288806, var26 ^ -577929143)];
            int var12 = 0;
            String var11;
            int var13 = (var11 = aaba(34605, var26 ^ -393100680, '渌')).length();
            int var10 = a(1228288807, var26 ^ 1437419574);
            int var29 = -1;

            label123:
            while (true) {
               String var32 = var11.substring(++var29, var29 + var10);
               var10001 = (byte)-1;

               while (true) {
                  label118: {
                     char[] var41 = var32.toCharArray();
                     var78 = var41.length;
                     int var14 = 0;
                     var61 = var41;
                     var10001 = var78;
                     char[] var82;
                     int var100;
                     if (var78 <= 1) {
                        var82 = var41;
                        var100 = var14;
                     } else {
                        var61 = var41;
                        var10001 = var78;
                        if (var78 <= var14) {
                           break label118;
                        }

                        var82 = var41;
                        var100 = var14;
                     }

                     while (true) {
                        var82[var100] = (char)(var82[var100] ^ switch (var14 % a(1228288801, var26 ^ 2098702243)) {
                           case 0 -> a(1228288802, var26 ^ 1018351258);
                           case 1 -> a(1228288803, var26 ^ -1629456718);
                           case 2 -> a(1228288796, var26 ^ -53172808);
                           case 3 -> a(1228288797, var26 ^ -612755454);
                           case 4 -> a(1228288798, var26 ^ -1680069753);
                           case 5 -> a(1228288799, var26 ^ -2113326291);
                           default -> a(1228288792, var26 ^ 283130819);
                        });
                        var14++;
                        if (var10001 == 0) {
                           var100 = var10001;
                           var82 = var61;
                        } else {
                           if (var10001 <= var14) {
                              break;
                           }

                           var82 = var61;
                           var100 = var14;
                        }
                     }
                  }

                  String var89 = new String(var61).intern();
                  switch (var10001) {
                     case 0:
                        var8[var12++] = var89;
                        if ((var29 += var10) >= var13) {
                           long var0 = 8680595894186594664L;
                           long[] var6 = new long[a(1228288793, var26 ^ 908571533)];
                           int var3 = 0;
                           String var4;
                           int var5 = (var4 = aaba(53283, var26 ^ 250008408, '渎')).length();
                           byte var2 = 0;

                           label97:
                           while (true) {
                              int var48 = var2;
                              var2 += 8;
                              String var34 = var4.substring(var48, var2);
                              var48 = (short)27414;
                              int var67 = var26 ^ -997592561;
                              short var90 = 28175;
                              byte[] var7 = var34.getBytes("ISO-8859-1");
                              long[] var35 = var6;
                              var48 = var3++;
                              long var68 = (var7[0] & 255L) << a(1228288794, var26 ^ -54191711)
                                 | (var7[1] & 255L) << a(1228288795, var26 ^ -1506767414)
                                 | (var7[2] & 255L) << a(1228288788, var26 ^ -784008808)
                                 | (var7[3] & 255L) << a(1228288789, var26 ^ 1359733648)
                                 | (var7[4] & 255L) << a(1228288790, var26 ^ -51275975)
                                 | (var7[5] & 255L) << a(1228288791, var26 ^ -287599268)
                                 | (var7[a(1228288784, var26 ^ -641782329)] & 255L) << a(1228288785, var26 ^ 2016513086)
                                 | var7[a(1228288786, var26 ^ -1467693169)] & 255L;
                              short var91 = -1;

                              while (true) {
                                 long var102 = var68 ^ var0;
                                 switch (var91) {
                                    case 0:
                                       var35[var48] = var102;
                                       if (var2 >= var5) {
                                          ababa = var6;
                                          bb = new Integer[a(1228288772, var26 ^ 110953029)];
                                          aabbb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288774, var26 ^ -1765201561)]),
                                             null,
                                             null,
                                             null,
                                             null,
                                             null,
                                             null,
                                             null,
                                             null
                                          );
                                          bbaa = new babaabb(
                                             aabbaaaba.aaab(var8[5]),
                                             abb(
                                                aab(a(1228288768, var26 ^ -2120716044), 4916757116614849526L),
                                                aab(a(1228288769, var26 ^ 957686343), 7974238464372621891L),
                                                aab(a(1228288770, var26 ^ -74729986), 7299499011087155963L)
                                             ),
                                             abb(
                                                aab(a(1228288771, var26 ^ 1799572958), 7633531214655475734L),
                                                aab(a(1228288892, var26 ^ -1429013312), 2200328976073967636L),
                                                aab(a(1228288893, var26 ^ 432276248), 8383875332120680738L)
                                             ),
                                             abb(
                                                aab(a(1228288894, var26 ^ -2113185982), 7633531214655475734L),
                                                aab(a(1228288895, var26 ^ 947225043), 9212293372406201647L),
                                                aab(a(1228288888, var26 ^ -721426609), 5737810015920577361L)
                                             ),
                                             abb(
                                                aab(a(1228288889, var26 ^ -1229884275), 3991315775489912628L),
                                                aab(a(1228288890, var26 ^ 2003365185), 8857948154754450067L),
                                                aab(a(1228288891, var26 ^ 308622223), 7443592998820878615L)
                                             ),
                                             abb(
                                                aab(a(1228288884, var26 ^ 101488046), 6879578713369844004L),
                                                aab(a(1228288885, var26 ^ -1973011553), 9157173759995390589L),
                                                aab(a(1228288886, var26 ^ 1652118659), 5658646418332442592L)
                                             ),
                                             abb(aab(a(1228288887, var26 ^ -1778907053), 4607672970022003771L), 2, 5),
                                             abb(
                                                aab(a(1228288880, var26 ^ 846250324), 7633531214655475734L),
                                                aab(a(1228288881, var26 ^ 566247942), 4926229772743157016L),
                                                aab(a(1228288882, var26 ^ -341816352), 324277240838743626L)
                                             ),
                                             abb(
                                                aab(a(1228288883, var26 ^ 2024239297), 7147472828322767254L),
                                                aab(a(1228288876, var26 ^ 167016387), 7074946594177665537L),
                                                aab(a(1228288877, var26 ^ 671301089), 227109451011190827L)
                                             )
                                          );
                                          baa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288879, var26 ^ -2118549768)]),
                                             abb(
                                                aab(a(1228288872, var26 ^ -1785333232), 7633531214655475734L),
                                                aab(a(1228288873, var26 ^ -334267931), 7244592283368397369L),
                                                aab(a(1228288874, var26 ^ 1611837096), 6921450651331992529L)
                                             ),
                                             abb(
                                                aab(a(1228288875, var26 ^ -2017907179), 7633531214655475734L),
                                                aab(a(1228288868, var26 ^ -1458932015), 8333754945669993275L),
                                                aab(a(1228288869, var26 ^ -1425173093), 7452136406438273038L)
                                             ),
                                             abb(
                                                aab(a(1228288870, var26 ^ 1119644453), 7633531214655475734L),
                                                aab(a(1228288871, var26 ^ 269591795), 7169126741457639311L),
                                                aab(a(1228288864, var26 ^ 852830323), 1596582454466001085L)
                                             ),
                                             abb(
                                                aab(a(1228288865, var26 ^ -595981796), 5015359556359192358L),
                                                aab(a(1228288866, var26 ^ -1413579981), 5718769175487795317L),
                                                aab(a(1228288867, var26 ^ 268245556), 6511573010720172365L)
                                             ),
                                             abb(
                                                aab(a(1228288860, var26 ^ 351444156), 1965288890615603448L),
                                                aab(a(1228288861, var26 ^ -2017733668), 8628188599814694136L),
                                                5
                                             ),
                                             abb(aab(a(1228288862, var26 ^ -1630404936), 517344813871059880L), 5, 2),
                                             abb(
                                                aab(a(1228288863, var26 ^ 1152513449), 7633531214655475734L),
                                                aab(a(1228288856, var26 ^ 16226972), 8003666525317177360L),
                                                aab(a(1228288857, var26 ^ 2073694833), 4211886533085513283L)
                                             ),
                                             abb(
                                                aab(a(1228288858, var26 ^ -930481560), 6219859745682134034L),
                                                aab(a(1228288859, var26 ^ -556352802), 3219520287556872945L),
                                                aab(a(1228288852, var26 ^ -1535623740), 8307809731407928638L)
                                             )
                                          );
                                          bbbb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288854, var26 ^ -1127734218)]),
                                             abb(
                                                aab(a(1228288855, var26 ^ 1896489758), 7633531214655475734L),
                                                aab(a(1228288848, var26 ^ -383327607), 533375697324235828L),
                                                aab(a(1228288849, var26 ^ -961996168), 1514916257654604148L)
                                             ),
                                             abb(
                                                aab(a(1228288850, var26 ^ 310895002), 2267354625203764229L),
                                                aab(a(1228288851, var26 ^ 916753388), 7633531214655475734L),
                                                aab(a(1228288844, var26 ^ -86804135), 5796642705116076914L)
                                             ),
                                             abb(
                                                aab(a(1228288845, var26 ^ -1098477794), 7633531214655475734L),
                                                aab(a(1228288846, var26 ^ -1827544720), 3345711528432984903L),
                                                aab(a(1228288847, var26 ^ -1824620278), 8975880469795531949L)
                                             ),
                                             abb(
                                                aab(a(1228288840, var26 ^ -651698847), 8433098556404212436L),
                                                aab(a(1228288841, var26 ^ 387111245), 2681291420975265505L),
                                                aab(a(1228288842, var26 ^ -358068336), 1965288890615603448L)
                                             ),
                                             abb(
                                                aab(a(1228288843, var26 ^ 1006177470), 189868851001126540L),
                                                aab(a(1228288836, var26 ^ 1627661562), 495310194614733642L),
                                                5
                                             ),
                                             abb(
                                                aab(a(1228288837, var26 ^ -1237196346), 6492269501124289667L),
                                                aab(a(1228288838, var26 ^ 1550911849), 7178326575363070340L),
                                                2
                                             ),
                                             abb(
                                                aab(a(1228288839, var26 ^ 2044985597), 7633531214655475734L),
                                                aab(a(1228288832, var26 ^ -247414755), 5771692879517874960L),
                                                aab(a(1228288833, var26 ^ -1179862686), 3238898717974461738L)
                                             ),
                                             abb(
                                                aab(a(1228288834, var26 ^ 2022624642), 6564620751208946058L),
                                                aab(a(1228288835, var26 ^ -1541954127), 5409856883205770234L),
                                                aab(a(1228288956, var26 ^ 1856421110), 443171478328910509L)
                                             )
                                          );
                                          aaaab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288958, var26 ^ 2000433146)]),
                                             abb(
                                                aab(a(1228288959, var26 ^ 1711615242), 2750234384901513667L),
                                                aab(a(1228288952, var26 ^ 1533862005), 7633531214655475734L),
                                                aab(a(1228288953, var26 ^ 1462248023), 8574221720018980948L)
                                             ),
                                             abb(
                                                aab(a(1228288954, var26 ^ -1060833448), 2043998326610721413L),
                                                aab(a(1228288955, var26 ^ -1085266758), 2138598843804224948L),
                                                aab(a(1228288948, var26 ^ 547354656), 7652349870338240336L)
                                             ),
                                             abb(
                                                aab(a(1228288949, var26 ^ -1989904417), 2267354625203764229L),
                                                aab(a(1228288950, var26 ^ 365372563), 7633531214655475734L),
                                                aab(a(1228288951, var26 ^ 1110853820), 6275348171945033784L)
                                             ),
                                             abb(
                                                aab(a(1228288944, var26 ^ -1547015654), 3281762143743536969L),
                                                aab(a(1228288945, var26 ^ -1347593879), 3096974191098101275L),
                                                aab(a(1228288946, var26 ^ 1730252599), 8931184414613437099L)
                                             ),
                                             abb(
                                                aab(a(1228288947, var26 ^ 1786138257), 7178326575363070340L),
                                                aab(a(1228288940, var26 ^ 1635779552), 2313266164713109224L),
                                                aab(a(1228288941, var26 ^ 329927928), 7178326575363070340L)
                                             ),
                                             abb(3, aab(a(1228288942, var26 ^ 936574290), 3663383110621354047L), 3),
                                             abb(
                                                aab(a(1228288943, var26 ^ -706914498), 6471182867173908705L),
                                                aab(a(1228288936, var26 ^ -657036516), 7633531214655475734L),
                                                aab(a(1228288937, var26 ^ -766358745), 1726218967163634167L)
                                             ),
                                             abb(
                                                aab(a(1228288938, var26 ^ -177192068), 3300228203071307223L),
                                                aab(a(1228288939, var26 ^ -919629764), 6542891787195811360L),
                                                aab(a(1228288932, var26 ^ -1294017452), 8487395396624725841L)
                                             )
                                          );
                                          baba = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288934, var26 ^ -1746799903)]),
                                             abb(
                                                aab(a(1228288935, var26 ^ 1705140739), 4136688224411201194L),
                                                aab(a(1228288928, var26 ^ 1298294247), 7218195903154949299L),
                                                aab(a(1228288929, var26 ^ 772255326), 5963642906137570921L)
                                             ),
                                             abb(
                                                aab(a(1228288930, var26 ^ 737832929), 3000172933473612618L),
                                                aab(a(1228288931, var26 ^ -210205417), 6420925973677907091L),
                                                aab(a(1228288924, var26 ^ 1032685958), 3836012671162057253L)
                                             ),
                                             abb(
                                                aab(a(1228288925, var26 ^ 285402191), 4907017903225878233L),
                                                aab(a(1228288926, var26 ^ 102336873), 7633531214655475734L),
                                                aab(a(1228288927, var26 ^ -1418640722), 3836012671162057253L)
                                             ),
                                             abb(
                                                aab(a(1228288920, var26 ^ -1713211896), 4727025530548689577L),
                                                aab(a(1228288921, var26 ^ -1985280337), 8147695520155873608L),
                                                aab(a(1228288922, var26 ^ 1585870432), 2631729265401413161L)
                                             ),
                                             abb(
                                                aab(a(1228288923, var26 ^ -737016551), 5185147082733639290L),
                                                aab(a(1228288916, var26 ^ -266769529), 3510994092461735382L),
                                                aab(a(1228288917, var26 ^ 2127169723), 3197600947013230863L)
                                             ),
                                             abb(
                                                3,
                                                aab(a(1228288918, var26 ^ -352596603), 3663383110621354047L),
                                                aab(a(1228288919, var26 ^ 1326609937), 4573205704718874271L)
                                             ),
                                             abb(
                                                aab(a(1228288912, var26 ^ -2082374961), 3790788531541212078L),
                                                aab(a(1228288913, var26 ^ 1959007850), 7633531214655475734L),
                                                aab(a(1228288914, var26 ^ -1858921047), 7013654915939873362L)
                                             ),
                                             abb(
                                                aab(a(1228288915, var26 ^ -1061579328), 8487395396624725841L),
                                                aab(a(1228288908, var26 ^ -704729974), 4198495189434139192L),
                                                aab(a(1228288909, var26 ^ -852277434), 3304710535157567462L)
                                             )
                                          );
                                          bba = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288911, var26 ^ 1059527542)]),
                                             abb(
                                                aab(a(1228288904, var26 ^ 1115024054), 3170042653311688974L),
                                                aab(a(1228288905, var26 ^ -1135688445), 4730877695994672310L),
                                                aab(a(1228288906, var26 ^ 319165301), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288907, var26 ^ 1438802020), 1139687018104210951L),
                                                aab(a(1228288900, var26 ^ 876011621), 3725131431803278983L),
                                                aab(a(1228288901, var26 ^ 1781102642), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288902, var26 ^ 1956377846), 5618524545355782469L),
                                                aab(a(1228288903, var26 ^ -56908790), 6959734976407358975L),
                                                aab(a(1228288896, var26 ^ 514868072), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288897, var26 ^ -19831487), 3581978045730448277L),
                                                aab(a(1228288898, var26 ^ -1956045472), 3000172933473612618L),
                                                aab(a(1228288899, var26 ^ 1578837698), 4026528961033743473L)
                                             ),
                                             abb(
                                                aab(a(1228289020, var26 ^ 1356553110), 4573205704718874271L),
                                                aab(a(1228289021, var26 ^ 1497596181), 8810023009359101827L),
                                                aab(a(1228289022, var26 ^ -2042339577), 1965288890615603448L)
                                             ),
                                             abb(
                                                3,
                                                aab(a(1228289023, var26 ^ 2136305342), 7178326575363070340L),
                                                aab(a(1228289016, var26 ^ -692982081), 8628188599814694136L)
                                             ),
                                             abb(
                                                aab(a(1228289017, var26 ^ -1993255476), 2914314646354857621L),
                                                aab(a(1228289018, var26 ^ 574105734), 5677986311253007161L),
                                                aab(a(1228289019, var26 ^ -1688038928), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228289012, var26 ^ 266901815), 6104822230724315261L),
                                                aab(a(1228289013, var26 ^ 1118113178), 8271025034212900203L),
                                                aab(a(1228289014, var26 ^ -1645247880), 2267354625203764229L)
                                             )
                                          );
                                          abaaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228289009, var26 ^ -1133988590)]),
                                             abb(
                                                aab(a(1228289010, var26 ^ -836077291), 3473474857517660433L),
                                                aab(a(1228289011, var26 ^ 737631895), 7357616444388637173L),
                                                aab(a(1228289004, var26 ^ 622343233), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228289005, var26 ^ 1888686096), 6077531749486970621L),
                                                aab(a(1228289006, var26 ^ -1355566730), 2914314646354857621L),
                                                aab(a(1228289007, var26 ^ 243044436), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228289000, var26 ^ -605575226), 3308907524255423505L),
                                                aab(a(1228289001, var26 ^ 11634715), 8990823591965954770L),
                                                aab(a(1228289002, var26 ^ 2063217251), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228289003, var26 ^ 2119076338), 4727025530548689577L),
                                                aab(a(1228288996, var26 ^ 360472699), 5757442261128209517L),
                                                aab(a(1228288997, var26 ^ -45894682), 8058811007864815837L)
                                             ),
                                             abb(
                                                aab(a(1228288998, var26 ^ -1002660255), 7178326575363070340L),
                                                aab(a(1228288999, var26 ^ 1122304341), 2975092345680777852L),
                                                aab(a(1228288992, var26 ^ -1855204254), 4727025530548689577L)
                                             ),
                                             abb(
                                                3,
                                                aab(a(1228288993, var26 ^ -1822538522), 1666460625251219299L),
                                                aab(a(1228288994, var26 ^ 1796405183), 8426186879079329148L)
                                             ),
                                             abb(
                                                aab(a(1228288995, var26 ^ 704343986), 2104798826629827304L),
                                                aab(a(1228288988, var26 ^ -2045425218), 218710794702194031L),
                                                aab(a(1228288989, var26 ^ -877151505), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288990, var26 ^ 1832097097), 4328896041783846181L),
                                                aab(a(1228288991, var26 ^ 1739915010), 9112869812020246017L),
                                                aab(a(1228288984, var26 ^ 1061699482), 5254334772719254642L)
                                             )
                                          );
                                          aa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288986, var26 ^ 229084718)]),
                                             abb(
                                                aab(a(1228288987, var26 ^ -2020852036), 1755900313962677705L),
                                                aab(a(1228288980, var26 ^ 303254514), 1963895171437162163L),
                                                aab(a(1228288981, var26 ^ -1054243009), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288982, var26 ^ -824652838), 7633531214655475734L),
                                                aab(a(1228288983, var26 ^ 1634544284), 5506518879924181660L),
                                                aab(a(1228288976, var26 ^ -1224149490), 4808216833889569949L)
                                             ),
                                             abb(
                                                aab(a(1228288977, var26 ^ 1853491494), 7406322068188673868L),
                                                aab(a(1228288978, var26 ^ -1876084444), 1658968772759467773L),
                                                aab(a(1228288979, var26 ^ 2001175324), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288972, var26 ^ -1975329615), 8705752287964337429L),
                                                aab(a(1228288973, var26 ^ -1020945885), 7272503685162239732L),
                                                aab(a(1228288974, var26 ^ 981577345), 4136688224411201194L)
                                             ),
                                             abb(
                                                aab(a(1228288975, var26 ^ -1646568402), 2151762808925216753L),
                                                aab(a(1228288968, var26 ^ -320986021), 7178326575363070340L),
                                                aab(a(1228288969, var26 ^ 904017750), 4727025530548689577L)
                                             ),
                                             abb(
                                                aab(a(1228288970, var26 ^ -1972351897), 7178326575363070340L),
                                                4,
                                                aab(a(1228288971, var26 ^ -1673279342), 8426186879079329148L)
                                             ),
                                             abb(
                                                aab(a(1228288964, var26 ^ 784108487), 5003497462781251174L),
                                                aab(a(1228288965, var26 ^ 1736397537), 6471182867173908705L),
                                                aab(a(1228288966, var26 ^ 113383401), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288967, var26 ^ 661120801), 3324426685776158758L),
                                                aab(a(1228288960, var26 ^ -1337674467), 3304714656839419106L),
                                                aab(a(1228288961, var26 ^ -1050922021), 3172537598773284020L)
                                             )
                                          );
                                          aabb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288572, var26 ^ 1824384937)]),
                                             abb(
                                                aab(a(1228288573, var26 ^ 113696136), 7633531214655475734L),
                                                aab(a(1228288574, var26 ^ -300397777), 8200216084026957094L),
                                                aab(a(1228288575, var26 ^ 408231054), 6248493943990812766L)
                                             ),
                                             abb(
                                                aab(a(1228288568, var26 ^ 154732596), 7633531214655475734L),
                                                aab(a(1228288569, var26 ^ -748133347), 1956349399735910000L),
                                                aab(a(1228288570, var26 ^ 1702658231), 2162166712723461455L)
                                             ),
                                             abb(
                                                aab(a(1228288571, var26 ^ 936505345), 7633531214655475734L),
                                                aab(a(1228288564, var26 ^ 1699962230), 4546945517469027244L),
                                                aab(a(1228288565, var26 ^ -893446881), 8439863564850121033L)
                                             ),
                                             abb(
                                                aab(a(1228288566, var26 ^ 637659693), 5340878925412173309L),
                                                aab(a(1228288567, var26 ^ -1127988910), 4727025530548689577L),
                                                aab(a(1228288560, var26 ^ 1270662258), 1934638054927081751L)
                                             ),
                                             abb(
                                                aab(a(1228288561, var26 ^ -106787536), 1965288890615603448L),
                                                aab(a(1228288562, var26 ^ -154213662), 4573205704718874271L),
                                                aab(a(1228288563, var26 ^ 2083348548), 2151762808925216753L)
                                             ),
                                             abb(
                                                aab(a(1228288556, var26 ^ -614877128), 9050315856985416689L),
                                                3,
                                                aab(a(1228288557, var26 ^ -1471962219), 7178326575363070340L)
                                             ),
                                             abb(
                                                aab(a(1228288558, var26 ^ -973853713), 7633531214655475734L),
                                                aab(a(1228288559, var26 ^ 1636614919), 8418594587473243090L),
                                                aab(a(1228288552, var26 ^ -1373680221), 8545058908539677814L)
                                             ),
                                             abb(
                                                aab(a(1228288553, var26 ^ -1536784775), 7676415412181116758L),
                                                aab(a(1228288554, var26 ^ 125196693), 6347829936401892174L),
                                                aab(a(1228288555, var26 ^ 1145908527), 1146305547555790572L)
                                             )
                                          );
                                          aba = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288550, var26 ^ -244951230)]),
                                             abb(
                                                aab(a(1228288551, var26 ^ 44635958), 6083937665397417893L),
                                                aab(a(1228288544, var26 ^ 1061994951), 6012771528168957092L),
                                                aab(a(1228288545, var26 ^ -880112395), 8444088412088731001L)
                                             ),
                                             abb(
                                                aab(a(1228288546, var26 ^ 1104589667), 2162166712723461455L),
                                                aab(a(1228288547, var26 ^ -1023094522), 8484745854736211858L),
                                                aab(a(1228288540, var26 ^ -1680567404), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288541, var26 ^ 2091266933), 3172537598773284020L),
                                                aab(a(1228288542, var26 ^ -600353569), 373750946798127999L),
                                                aab(a(1228288543, var26 ^ -2019195422), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288536, var26 ^ 246947046), 9157850575925723439L),
                                                aab(a(1228288537, var26 ^ -2017580806), 2866302764461017879L),
                                                aab(a(1228288538, var26 ^ 368581745), 4136688224411201194L)
                                             ),
                                             abb(
                                                aab(a(1228288539, var26 ^ 1359923552), 944531883011503034L),
                                                aab(a(1228288532, var26 ^ 521311922), 8810023009359101827L),
                                                aab(a(1228288533, var26 ^ -356772436), 2587329478409854450L)
                                             ),
                                             abb(
                                                aab(a(1228288534, var26 ^ 35653291), 1666460625251219299L),
                                                aab(a(1228288535, var26 ^ -1989669755), 4573205704718874271L),
                                                aab(a(1228288528, var26 ^ 336546336), 8426186879079329148L)
                                             ),
                                             abb(
                                                aab(a(1228288529, var26 ^ 281209553), 1102025943634303298L),
                                                aab(a(1228288530, var26 ^ 597010264), 8271077935973541293L),
                                                aab(a(1228288531, var26 ^ 1588520516), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288524, var26 ^ -1922083783), 246849666886928170L),
                                                aab(a(1228288525, var26 ^ 97020315), 290897963648073389L),
                                                aab(a(1228288526, var26 ^ -154457978), 6487693875220480497L)
                                             )
                                          );
                                          aaaaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288520, var26 ^ -2059962586)]),
                                             abb(
                                                aab(a(1228288521, var26 ^ 1623073110), 536362840566306970L),
                                                aab(a(1228288522, var26 ^ 470624326), 5808988880334897997L),
                                                aab(a(1228288523, var26 ^ -1219540001), 8024304458915321053L)
                                             ),
                                             abb(
                                                aab(a(1228288516, var26 ^ 696890709), 8297106498563532910L),
                                                aab(a(1228288517, var26 ^ 1735197443), 7316936013357706740L),
                                                aab(a(1228288518, var26 ^ 552731726), 3531909945964126322L)
                                             ),
                                             abb(
                                                aab(a(1228288519, var26 ^ -1829118041), 1578435852069665325L),
                                                aab(a(1228288512, var26 ^ 855822037), 9143386050797803309L),
                                                aab(a(1228288513, var26 ^ -670154653), 4026980535467073435L)
                                             ),
                                             abb(
                                                aab(a(1228288514, var26 ^ -698183997), 2066098345999352765L),
                                                aab(a(1228288515, var26 ^ -159287463), 8931184414613437099L),
                                                aab(a(1228288636, var26 ^ -823371579), 8058811007864815837L)
                                             ),
                                             abb(
                                                aab(a(1228288637, var26 ^ -1852987066), 944531883011503034L),
                                                aab(a(1228288638, var26 ^ -1445278424), 8628188599814694136L),
                                                aab(a(1228288639, var26 ^ 1479338636), 4727025530548689577L)
                                             ),
                                             abb(
                                                aab(a(1228288632, var26 ^ -132300977), 1666460625251219299L),
                                                4,
                                                aab(a(1228288633, var26 ^ -1507645720), 8628188599814694136L)
                                             ),
                                             abb(
                                                aab(a(1228288634, var26 ^ -824329217), 5233840118902856661L),
                                                aab(a(1228288635, var26 ^ 1542439955), 218710794702194031L),
                                                aab(a(1228288628, var26 ^ -280018444), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288629, var26 ^ 1335660328), 7894548187218845683L),
                                                aab(a(1228288630, var26 ^ 2058433973), 3540538442107503146L),
                                                aab(a(1228288631, var26 ^ -166626134), 8516598183330668059L)
                                             )
                                          );
                                          baaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288626, var26 ^ -1923731482)]),
                                             abb(
                                                aab(a(1228288627, var26 ^ 2106619352), 7241446744814906460L),
                                                aab(a(1228288620, var26 ^ 176412014), 837815168858924049L),
                                                aab(a(1228288621, var26 ^ 1788430294), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288622, var26 ^ -1707140944), 6471182867173908705L),
                                                aab(a(1228288623, var26 ^ 666066586), 2169586396142267002L),
                                                aab(a(1228288616, var26 ^ -1960908982), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288617, var26 ^ 1831931727), 6424637567045845437L),
                                                aab(a(1228288618, var26 ^ 420369652), 6160913679941081960L),
                                                aab(a(1228288619, var26 ^ -186918239), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288612, var26 ^ 1294211463), 8311098077217910084L),
                                                aab(a(1228288613, var26 ^ 1808536359), 8937878419486709506L),
                                                aab(a(1228288614, var26 ^ 342717090), 6741049653379598855L)
                                             ),
                                             abb(
                                                aab(a(1228288615, var26 ^ -926331100), 944531883011503034L),
                                                aab(a(1228288608, var26 ^ 898583843), 7178326575363070340L),
                                                aab(a(1228288609, var26 ^ 182867852), 4024948953023738258L)
                                             ),
                                             abb(
                                                aab(a(1228288610, var26 ^ 1438055119), 4573205704718874271L),
                                                4,
                                                aab(a(1228288611, var26 ^ -482563958), 944531883011503034L)
                                             ),
                                             abb(
                                                aab(a(1228288604, var26 ^ 300862873), 7492069513988094304L),
                                                aab(a(1228288605, var26 ^ 87780876), 6471182867173908705L),
                                                aab(a(1228288606, var26 ^ 2035116971), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288607, var26 ^ 1115818113), 4712461090140822817L),
                                                aab(a(1228288600, var26 ^ -1608429532), 2540214088877506902L),
                                                aab(a(1228288601, var26 ^ -909118152), 1160162731659878898L)
                                             )
                                          );
                                          aabab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288596, var26 ^ -2052636253)]),
                                             abb(
                                                0,
                                                aab(a(1228288597, var26 ^ -1546053516), 5513933276910241661L),
                                                aab(a(1228288598, var26 ^ 76247813), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288599, var26 ^ -1810973349), 7633531214655475734L),
                                                aab(a(1228288592, var26 ^ -545082443), 5487831066075976473L),
                                                aab(a(1228288593, var26 ^ 1348617914), 8790634117094831805L)
                                             ),
                                             abb(
                                                aab(a(1228288594, var26 ^ -1116078226), 7357616444388637173L),
                                                aab(a(1228288595, var26 ^ -1184690808), 7633531214655475734L),
                                                aab(a(1228288588, var26 ^ -1431516007), 7190704454606753461L)
                                             ),
                                             abb(
                                                aab(a(1228288589, var26 ^ -879976251), 1965288890615603448L),
                                                aab(a(1228288590, var26 ^ 559714365), 5757442261128209517L),
                                                aab(a(1228288591, var26 ^ 64893050), 7720362004897306818L)
                                             ),
                                             abb(
                                                5,
                                                aab(a(1228288584, var26 ^ 333479953), 3663383110621354047L),
                                                aab(a(1228288585, var26 ^ -895787740), 1965288890615603448L)
                                             ),
                                             abb(2, 4, aab(a(1228288586, var26 ^ 2136710027), 8628188599814694136L)),
                                             abb(
                                                aab(a(1228288587, var26 ^ -276389855), 6126076398849109426L),
                                                aab(a(1228288580, var26 ^ -1966794612), 1995331826240761698L),
                                                aab(a(1228288581, var26 ^ 1367317429), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288582, var26 ^ -61578065), 4584841447972280050L),
                                                aab(a(1228288583, var26 ^ -1538168342), 7438738158143831538L),
                                                aab(a(1228288576, var26 ^ -1982938676), 6280947626001897750L)
                                             )
                                          );
                                          ababb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288579, var26 ^ -1462370875)]),
                                             abb(
                                                aab(a(1228288700, var26 ^ 1168275589), 7633531214655475734L),
                                                aab(a(1228288701, var26 ^ 244313378), 8235425965450166388L),
                                                aab(a(1228288702, var26 ^ -77771547), 8695924421886362036L)
                                             ),
                                             abb(
                                                aab(a(1228288703, var26 ^ 1673428995), 7633531214655475734L),
                                                aab(a(1228288696, var26 ^ 2119061937), 1951559846084668650L),
                                                0
                                             ),
                                             abb(
                                                aab(a(1228288697, var26 ^ -687288267), 7633531214655475734L),
                                                aab(a(1228288698, var26 ^ 22304728), 2417565534520884696L),
                                                aab(a(1228288699, var26 ^ 1238278038), 7328745741418206220L)
                                             ),
                                             abb(
                                                aab(a(1228288692, var26 ^ -1756034011), 4136688224411201194L),
                                                aab(a(1228288693, var26 ^ -923146684), 5657143728977474870L),
                                                aab(a(1228288694, var26 ^ -904090036), 6641792190389083698L)
                                             ),
                                             abb(
                                                aab(a(1228288695, var26 ^ 117932858), 1965288890615603448L),
                                                aab(a(1228288688, var26 ^ -1959761560), 7178326575363070340L),
                                                aab(a(1228288689, var26 ^ 1627216844), 1965288890615603448L)
                                             ),
                                             abb(
                                                aab(a(1228288690, var26 ^ 1503629988), 3663383110621354047L),
                                                3,
                                                aab(a(1228288691, var26 ^ -1511943834), 8628188599814694136L)
                                             ),
                                             abb(
                                                aab(a(1228288684, var26 ^ 417646016), 7633531214655475734L),
                                                aab(a(1228288685, var26 ^ 752527472), 456500881937056508L),
                                                aab(a(1228288686, var26 ^ 1174976653), 2914314646354857621L)
                                             ),
                                             abb(
                                                aab(a(1228288687, var26 ^ 1103802847), 9012562849994008091L),
                                                aab(a(1228288680, var26 ^ 455310750), 1803183750535471054L),
                                                aab(a(1228288681, var26 ^ -876060133), 2602550301431034879L)
                                             )
                                          );
                                          aaba = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288683, var26 ^ -2080277578)]),
                                             abb(
                                                0,
                                                aab(a(1228288676, var26 ^ -1595172209), 3172537598773284020L),
                                                aab(a(1228288677, var26 ^ -1179979726), 6280947626001897750L)
                                             ),
                                             abb(
                                                aab(a(1228288678, var26 ^ 2126879032), 1821154349058450480L),
                                                aab(a(1228288679, var26 ^ -1566187670), 2162166712723461455L),
                                                aab(a(1228288672, var26 ^ 11362939), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288673, var26 ^ 249826806), 9143386050797803309L),
                                                aab(a(1228288674, var26 ^ 705926629), 8959656859491820351L),
                                                aab(a(1228288675, var26 ^ 1478645070), 6690486294875186455L)
                                             ),
                                             abb(
                                                aab(a(1228288668, var26 ^ 709797619), 1965288890615603448L),
                                                aab(a(1228288669, var26 ^ 1322747558), 8705752287964337429L),
                                                aab(a(1228288670, var26 ^ -1804889995), 4136688224411201194L)
                                             ),
                                             abb(
                                                5,
                                                aab(a(1228288671, var26 ^ -1202232418), 944531883011503034L),
                                                aab(a(1228288664, var26 ^ -1078780165), 8937878419486709506L)
                                             ),
                                             abb(
                                                2,
                                                aab(a(1228288665, var26 ^ -820295451), 4573205704718874271L),
                                                aab(a(1228288666, var26 ^ -679456950), 944531883011503034L)
                                             ),
                                             abb(
                                                aab(a(1228288667, var26 ^ -1756213981), 2422054331075961077L),
                                                aab(a(1228288660, var26 ^ -149730050), 1210755091904459984L),
                                                aab(a(1228288661, var26 ^ -729051650), 5602928108100706922L)
                                             ),
                                             abb(
                                                aab(a(1228288662, var26 ^ 1227027433), 7328745741418206220L),
                                                aab(a(1228288663, var26 ^ 880476035), 8041255905564684061L),
                                                aab(a(1228288656, var26 ^ -1689894104), 2267354625203764229L)
                                             )
                                          );
                                          aabaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288659, var26 ^ 792025804)]),
                                             abb(
                                                aab(a(1228288652, var26 ^ 847446655), 8790716979449620485L),
                                                aab(a(1228288653, var26 ^ 1488812996), 7633531214655475734L),
                                                aab(a(1228288654, var26 ^ 369935527), 2417565534520884696L)
                                             ),
                                             abb(
                                                aab(a(1228288655, var26 ^ 1194155524), 4712461090140822817L),
                                                aab(a(1228288648, var26 ^ -1981383010), 6543107361491206662L),
                                                aab(a(1228288649, var26 ^ 1227166675), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288650, var26 ^ -11584233), 2417565534520884696L),
                                                aab(a(1228288651, var26 ^ -740800916), 7633531214655475734L),
                                                aab(a(1228288644, var26 ^ 1007061153), 2914314646354857621L)
                                             ),
                                             abb(
                                                aab(a(1228288645, var26 ^ -1720562226), 8937878419486709506L),
                                                aab(a(1228288646, var26 ^ 2015785934), 723426449249977118L),
                                                aab(a(1228288647, var26 ^ -343115999), 3000172933473612618L)
                                             ),
                                             abb(
                                                aab(a(1228288640, var26 ^ -776666341), 4573205704718874271L),
                                                aab(a(1228288641, var26 ^ 909830837), 2151762808925216753L),
                                                aab(a(1228288642, var26 ^ 969439500), 1965288890615603448L)
                                             ),
                                             abb(
                                                3,
                                                aab(a(1228288643, var26 ^ -1692182391), 4573205704718874271L),
                                                aab(a(1228288764, var26 ^ -459692495), 8628188599814694136L)
                                             ),
                                             abb(
                                                aab(a(1228288765, var26 ^ 823721766), 8200011981022107306L),
                                                aab(a(1228288766, var26 ^ 1040622785), 7633531214655475734L),
                                                aab(a(1228288767, var26 ^ 2087765840), 7492069513988094304L)
                                             ),
                                             abb(
                                                aab(a(1228288760, var26 ^ 1673624282), 8948205317375760829L),
                                                aab(a(1228288761, var26 ^ 852701144), 2267354625203764229L),
                                                aab(a(1228288762, var26 ^ 1306013083), 8676685351026229856L)
                                             )
                                          );
                                          abaab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288757, var26 ^ 937374322)]),
                                             abb(
                                                aab(a(1228288758, var26 ^ -1047337932), 7633531214655475734L),
                                                aab(a(1228288759, var26 ^ 816785391), 5929266194955549924L),
                                                aab(a(1228288752, var26 ^ 1652475749), 1180649064936491360L)
                                             ),
                                             abb(
                                                aab(a(1228288753, var26 ^ -815352597), 7357616444388637173L),
                                                aab(a(1228288754, var26 ^ 661967715), 3380329022027925959L),
                                                aab(a(1228288755, var26 ^ 26431987), 2878788644712276115L)
                                             ),
                                             abb(
                                                aab(a(1228288748, var26 ^ -1092852558), 7633531214655475734L),
                                                aab(a(1228288749, var26 ^ -1367479380), 8077958274173563882L),
                                                aab(a(1228288750, var26 ^ -1191174565), 1791694954766841485L)
                                             ),
                                             abb(
                                                aab(a(1228288751, var26 ^ -915842203), 1768873870145182395L),
                                                aab(a(1228288744, var26 ^ 1770032880), 6899718642643578237L),
                                                aab(a(1228288745, var26 ^ -749631294), 7420256811420533807L)
                                             ),
                                             abb(
                                                aab(a(1228288746, var26 ^ 1099668400), 4727025530548689577L),
                                                aab(a(1228288747, var26 ^ -796097306), 8937878419486709506L),
                                                aab(a(1228288740, var26 ^ -2134235076), 3000172933473612618L)
                                             ),
                                             abb(
                                                aab(a(1228288741, var26 ^ -1730074211), 9050315856985416689L),
                                                aab(a(1228288742, var26 ^ -1365494092), 8426186879079329148L),
                                                aab(a(1228288743, var26 ^ 1024962148), 4727025530548689577L)
                                             ),
                                             abb(
                                                aab(a(1228288736, var26 ^ 835207213), 1210755091904459984L),
                                                aab(a(1228288737, var26 ^ -957639620), 1210755091904459984L),
                                                aab(a(1228288738, var26 ^ -877865867), 8735580216565253103L)
                                             ),
                                             abb(
                                                aab(a(1228288739, var26 ^ 372067460), 7635801234406773128L),
                                                aab(a(1228288732, var26 ^ -824018416), 3690709814190034314L),
                                                aab(a(1228288733, var26 ^ 975335643), 3836012671162057253L)
                                             )
                                          );
                                          baab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288728, var26 ^ 1742128844)]),
                                             abb(
                                                aab(a(1228288729, var26 ^ 326882525), 2445978862926237051L),
                                                aab(a(1228288730, var26 ^ -2106122476), 8435457117374508157L),
                                                aab(a(1228288731, var26 ^ -1831593856), 6788815115536801349L)
                                             ),
                                             abb(
                                                aab(a(1228288724, var26 ^ 149925162), 5512071967158656410L),
                                                aab(a(1228288725, var26 ^ 731667711), 3839653050040128481L),
                                                aab(a(1228288726, var26 ^ 1575370167), 284095919221822536L)
                                             ),
                                             abb(
                                                aab(a(1228288727, var26 ^ -2069403982), 5362300506693843187L),
                                                aab(a(1228288720, var26 ^ 285778984), 1102025943634303298L),
                                                aab(a(1228288721, var26 ^ 1238859065), 6654598230564856779L)
                                             ),
                                             abb(
                                                aab(a(1228288722, var26 ^ 164768619), 1768873870145182395L),
                                                aab(a(1228288723, var26 ^ -1238981461), 729298787708221680L),
                                                aab(a(1228288716, var26 ^ 1508704836), 7420256811420533807L)
                                             ),
                                             abb(
                                                aab(a(1228288717, var26 ^ -1085309625), 1965288890615603448L),
                                                aab(a(1228288718, var26 ^ 1198074522), 8931184414613437099L),
                                                aab(a(1228288719, var26 ^ 1218862793), 3000172933473612618L)
                                             ),
                                             abb(
                                                aab(a(1228288712, var26 ^ 308820858), 3663383110621354047L),
                                                aab(a(1228288713, var26 ^ -1094066613), 944531883011503034L),
                                                aab(a(1228288714, var26 ^ 762617302), 4727025530548689577L)
                                             ),
                                             abb(
                                                aab(a(1228288715, var26 ^ -1071249672), 301642469318958802L),
                                                aab(a(1228288708, var26 ^ -836295657), 3800100481506247570L),
                                                aab(a(1228288709, var26 ^ 247150297), 8545058908539677814L)
                                             ),
                                             abb(
                                                aab(a(1228288710, var26 ^ -309134883), 1340570190485711000L),
                                                aab(a(1228288711, var26 ^ 950968355), 6487693875220480497L),
                                                aab(a(1228288704, var26 ^ -466984497), 5238399469542893738L)
                                             )
                                          );
                                          aab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288706, var26 ^ 923843720)]),
                                             abb(
                                                aab(a(1228288707, var26 ^ -1109745561), 456500881937056508L),
                                                aab(a(1228288316, var26 ^ -931269432), 8235425965450166388L),
                                                aab(a(1228288317, var26 ^ -436908219), 7302376073795387218L)
                                             ),
                                             abb(
                                                aab(a(1228288318, var26 ^ 1967643594), 4954652435858751228L),
                                                aab(a(1228288319, var26 ^ 467466292), 4440794565821247753L),
                                                aab(a(1228288312, var26 ^ 1708794131), 3090134751397654704L)
                                             ),
                                             abb(
                                                aab(a(1228288313, var26 ^ -1413811059), 8008127929311884886L),
                                                aab(a(1228288314, var26 ^ 69142617), 7676415412181116758L),
                                                aab(a(1228288315, var26 ^ -44564541), 578837099923228707L)
                                             ),
                                             abb(
                                                aab(a(1228288308, var26 ^ 937690470), 7720362004897306818L),
                                                aab(a(1228288309, var26 ^ -919916211), 723426449249977118L),
                                                aab(a(1228288310, var26 ^ 616247915), 9015607380381265772L)
                                             ),
                                             abb(
                                                aab(a(1228288311, var26 ^ 430890757), 8937878419486709506L),
                                                aab(a(1228288304, var26 ^ -283191722), 4727025530548689577L),
                                                aab(a(1228288305, var26 ^ -1674315003), 8311098077217910084L)
                                             ),
                                             abb(
                                                aab(a(1228288306, var26 ^ -1798640324), 8628188599814694136L),
                                                aab(a(1228288307, var26 ^ -749022896), 7178326575363070340L),
                                                aab(a(1228288300, var26 ^ 1775317742), 2151762808925216753L)
                                             ),
                                             abb(
                                                aab(a(1228288301, var26 ^ 1983490640), 898341377869943912L),
                                                aab(a(1228288302, var26 ^ -1451306564), 3380329022027925959L),
                                                aab(a(1228288303, var26 ^ -1188648793), 2914314646354857621L)
                                             ),
                                             abb(
                                                aab(a(1228288296, var26 ^ -1085714918), 5806961342920718759L),
                                                aab(a(1228288297, var26 ^ 581515640), 521432568379155380L),
                                                aab(a(1228288298, var26 ^ 1992017121), 4110600444392962559L)
                                             )
                                          );
                                          abab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288293, var26 ^ 414861155)]),
                                             abb(
                                                aab(a(1228288294, var26 ^ -1331560840), 7633531214655475734L),
                                                aab(a(1228288295, var26 ^ 493824722), 7420256811420533807L),
                                                aab(a(1228288288, var26 ^ -1591757423), 4688888437419369613L)
                                             ),
                                             abb(
                                                aab(a(1228288289, var26 ^ 139643069), 7633531214655475734L),
                                                aab(a(1228288290, var26 ^ -796411558), 2445978862926237051L),
                                                aab(a(1228288291, var26 ^ 822008082), 6433427610418333553L)
                                             ),
                                             abb(
                                                aab(a(1228288284, var26 ^ -588866681), 7633531214655475734L),
                                                aab(a(1228288285, var26 ^ -1789806663), 2323239015759440154L),
                                                aab(a(1228288286, var26 ^ 1717959690), 4110600444392962559L)
                                             ),
                                             abb(
                                                aab(a(1228288287, var26 ^ 107941639), 5487831066075976473L),
                                                aab(a(1228288280, var26 ^ -58791469), 1965288890615603448L),
                                                aab(a(1228288281, var26 ^ 1951692134), 5757442261128209517L)
                                             ),
                                             abb(
                                                aab(a(1228288282, var26 ^ -270854428), 1965288890615603448L),
                                                aab(a(1228288283, var26 ^ -1723244774), 1666460625251219299L),
                                                aab(a(1228288276, var26 ^ 625911179), 9050315856985416689L)
                                             ),
                                             abb(
                                                aab(a(1228288277, var26 ^ 832221121), 8628188599814694136L),
                                                2,
                                                aab(a(1228288278, var26 ^ 551659211), 1666460625251219299L)
                                             ),
                                             abb(
                                                aab(a(1228288279, var26 ^ 2137913759), 7633531214655475734L),
                                                aab(a(1228288272, var26 ^ 1004539367), 3380329022027925959L),
                                                aab(a(1228288273, var26 ^ 870794488), 218710794702194031L)
                                             ),
                                             abb(
                                                aab(a(1228288274, var26 ^ -1221977694), 4026977832919788482L),
                                                aab(a(1228288275, var26 ^ 815811119), 998920642560127884L),
                                                aab(a(1228288268, var26 ^ 1591654918), 7302376073795387218L)
                                             )
                                          );
                                          abbb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288271, var26 ^ -1288410337)]),
                                             abb(
                                                aab(a(1228288264, var26 ^ -1233075950), 7633531214655475734L),
                                                aab(a(1228288265, var26 ^ 1763337539), 8027015413918827101L),
                                                aab(a(1228288266, var26 ^ -1162386268), 9211019481087827998L)
                                             ),
                                             abb(
                                                aab(a(1228288267, var26 ^ -1128801299), 7633531214655475734L),
                                                aab(a(1228288260, var26 ^ 1350941913), 1900122567571737637L),
                                                aab(a(1228288261, var26 ^ 401799359), 1945196983223515889L)
                                             ),
                                             abb(
                                                aab(a(1228288262, var26 ^ -448701005), 7633531214655475734L),
                                                aab(a(1228288263, var26 ^ -2000393045), 7948758484396502335L),
                                                aab(a(1228288256, var26 ^ 1123365493), 2817389096348268473L)
                                             ),
                                             abb(
                                                aab(a(1228288257, var26 ^ -770863106), 5487831066075976473L),
                                                aab(a(1228288258, var26 ^ -120824180), 8931184414613437099L),
                                                aab(a(1228288259, var26 ^ 1602146646), 7653713980845441640L)
                                             ),
                                             abb(
                                                aab(a(1228288380, var26 ^ 531629107), 1965288890615603448L),
                                                aab(a(1228288381, var26 ^ 1808967059), 7178326575363070340L),
                                                aab(a(1228288382, var26 ^ 26709589), 4573205704718874271L)
                                             ),
                                             abb(aab(a(1228288383, var26 ^ -634941646), 8628188599814694136L), 4, 3),
                                             abb(
                                                aab(a(1228288376, var26 ^ 597306227), 7633531214655475734L),
                                                aab(a(1228288377, var26 ^ 877980748), 301642469318958802L),
                                                aab(a(1228288378, var26 ^ -1113380491), 854757657317285740L)
                                             ),
                                             abb(
                                                aab(a(1228288379, var26 ^ -1557667469), 6280947626001897750L),
                                                aab(a(1228288372, var26 ^ -1114458390), 6808963063845000665L),
                                                aab(a(1228288373, var26 ^ -705855969), 8487395396624725841L)
                                             )
                                          );
                                          a = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288368, var26 ^ -1757678216)]),
                                             abb(
                                                aab(a(1228288369, var26 ^ 1558368447), 7633531214655475734L),
                                                aab(a(1228288370, var26 ^ 1508195319), 8077958274173563882L),
                                                aab(a(1228288371, var26 ^ 19803332), 2046195019728976207L)
                                             ),
                                             abb(
                                                aab(a(1228288364, var26 ^ 20213728), 7633531214655475734L),
                                                aab(a(1228288365, var26 ^ 1036666140), 8959656859491820351L),
                                                aab(a(1228288366, var26 ^ 312840607), 2576278970354181198L)
                                             ),
                                             abb(
                                                aab(a(1228288367, var26 ^ -713623215), 7633531214655475734L),
                                                aab(a(1228288360, var26 ^ -1346190981), 8790634117094831805L),
                                                aab(a(1228288361, var26 ^ -1915719395), 4920595731164266948L)
                                             ),
                                             abb(
                                                aab(a(1228288362, var26 ^ 966044512), 6899718642643578237L),
                                                aab(a(1228288363, var26 ^ -50774439), 8360331305712215924L),
                                                aab(a(1228288356, var26 ^ -1367541564), 7616375181909950680L)
                                             ),
                                             abb(
                                                aab(a(1228288357, var26 ^ 1936800246), 7616375181909950680L),
                                                aab(a(1228288358, var26 ^ 578967424), 8426186879079329148L),
                                                5
                                             ),
                                             abb(
                                                aab(a(1228288359, var26 ^ 564061628), 3663383110621354047L),
                                                aab(a(1228288352, var26 ^ -72211084), 1666460625251219299L),
                                                2
                                             ),
                                             abb(
                                                aab(a(1228288353, var26 ^ 1395082509), 7633531214655475734L),
                                                aab(a(1228288354, var26 ^ 1883389070), 8008127929311884886L),
                                                aab(a(1228288355, var26 ^ 2014839383), 1572252641514777933L)
                                             ),
                                             abb(
                                                aab(a(1228288348, var26 ^ -740083199), 3172537598773284020L),
                                                aab(a(1228288349, var26 ^ -1917706691), 6083937665397417893L),
                                                aab(a(1228288350, var26 ^ 986965272), 8235425965450166388L)
                                             )
                                          );
                                          aaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288345, var26 ^ 369917174)]),
                                             abb(
                                                aab(a(1228288346, var26 ^ -1996573493), 1945196983223515889L),
                                                aab(a(1228288347, var26 ^ -828322626), 7633531214655475734L),
                                                aab(a(1228288340, var26 ^ -1780552149), 7547246028027173305L)
                                             ),
                                             abb(
                                                aab(a(1228288341, var26 ^ 1125117181), 268944401848152926L),
                                                aab(a(1228288342, var26 ^ -514540128), 6690486294875186455L),
                                                aab(a(1228288343, var26 ^ -2025912711), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288336, var26 ^ -268916842), 5512420128672407146L),
                                                aab(a(1228288337, var26 ^ 558840379), 7633531214655475734L),
                                                aab(a(1228288338, var26 ^ 1044682160), 8790634117094831805L)
                                             ),
                                             abb(
                                                aab(a(1228288339, var26 ^ 1437987555), 4727025530548689577L),
                                                aab(a(1228288332, var26 ^ 303730752), 7720362004897306818L),
                                                aab(a(1228288333, var26 ^ -1980064454), 8360331305712215924L)
                                             ),
                                             abb(
                                                aab(a(1228288334, var26 ^ 1054295735), 4573205704718874271L),
                                                aab(a(1228288335, var26 ^ -501936865), 3510994092461735382L),
                                                aab(a(1228288328, var26 ^ -1779595939), 8426186879079329148L)
                                             ),
                                             abb(
                                                3,
                                                aab(a(1228288329, var26 ^ -950939779), 3663383110621354047L),
                                                aab(a(1228288330, var26 ^ -545724071), 1666460625251219299L)
                                             ),
                                             abb(
                                                aab(a(1228288331, var26 ^ -382129562), 2422054331075961077L),
                                                aab(a(1228288324, var26 ^ -1625448817), 7633531214655475734L),
                                                aab(a(1228288325, var26 ^ -1950655933), 9085169832361773599L)
                                             ),
                                             abb(
                                                aab(a(1228288326, var26 ^ 188074140), 1072471363470256482L),
                                                aab(a(1228288327, var26 ^ 1183784688), 3918036619054689521L),
                                                aab(a(1228288320, var26 ^ 1328469445), 7171108623406321204L)
                                             )
                                          );
                                          b = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288323, var26 ^ 302682542)]),
                                             abb(
                                                aab(a(1228288444, var26 ^ -539417820), 1768873870145182395L),
                                                aab(a(1228288445, var26 ^ -860610541), 4073937517675301075L),
                                                aab(a(1228288446, var26 ^ 846995736), 6424637567045845437L)
                                             ),
                                             abb(
                                                aab(a(1228288447, var26 ^ -1721813133), 2402432843589244460L),
                                                aab(a(1228288440, var26 ^ 438997406), 1351022141499980590L),
                                                aab(a(1228288441, var26 ^ 1800382663), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288442, var26 ^ 195085213), 7302376073795387218L),
                                                aab(a(1228288443, var26 ^ 1197911833), 8545058908539677814L),
                                                aab(a(1228288436, var26 ^ 1240389201), 8959656859491820351L)
                                             ),
                                             abb(
                                                aab(a(1228288437, var26 ^ -1902108308), 1965288890615603448L),
                                                aab(a(1228288438, var26 ^ -956508697), 3000172933473612618L),
                                                aab(a(1228288439, var26 ^ 1346050896), 8058811007864815837L)
                                             ),
                                             abb(
                                                aab(a(1228288432, var26 ^ -243999765), 1666460625251219299L),
                                                aab(a(1228288433, var26 ^ -1115078354), 2151762808925216753L),
                                                aab(a(1228288434, var26 ^ -1676766585), 4727025530548689577L)
                                             ),
                                             abb(
                                                2,
                                                aab(a(1228288435, var26 ^ -1031293015), 4573205704718874271L),
                                                aab(a(1228288428, var26 ^ 541189927), 8426186879079329148L)
                                             ),
                                             abb(
                                                aab(a(1228288429, var26 ^ 1941200972), 6690486294875186455L),
                                                aab(a(1228288430, var26 ^ 1709457034), 7315275268593678551L),
                                                aab(a(1228288431, var26 ^ 246595170), 5677986311253007161L)
                                             ),
                                             abb(
                                                aab(a(1228288424, var26 ^ -373491353), 6104822230724315261L),
                                                aab(a(1228288425, var26 ^ -1746410459), 2613304391289960766L),
                                                aab(a(1228288426, var26 ^ -1778456639), 5238399469542893738L)
                                             )
                                          );
                                          abb = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288421, var26 ^ 336105738)]),
                                             abb(
                                                aab(a(1228288422, var26 ^ 108255403), 64241801610018870L),
                                                aab(a(1228288423, var26 ^ 1130596346), 8701225971751599302L),
                                                aab(a(1228288416, var26 ^ -453739557), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288417, var26 ^ -13476804), 284095919221822536L),
                                                aab(a(1228288418, var26 ^ 1061406587), 4907017903225878233L),
                                                aab(a(1228288419, var26 ^ -656853552), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288412, var26 ^ 100218046), 7676415412181116758L),
                                                aab(a(1228288413, var26 ^ -1459459865), 3380329022027925959L),
                                                aab(a(1228288414, var26 ^ -778532355), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288415, var26 ^ 1343268817), 8931184414613437099L),
                                                aab(a(1228288408, var26 ^ -336513260), 8360331305712215924L),
                                                aab(a(1228288409, var26 ^ -1161517235), 5487831066075976473L)
                                             ),
                                             abb(
                                                aab(a(1228288410, var26 ^ -1723040097), 8628188599814694136L),
                                                aab(a(1228288411, var26 ^ -1598839134), 944531883011503034L),
                                                aab(a(1228288404, var26 ^ 504002066), 8937878419486709506L)
                                             ),
                                             abb(
                                                4,
                                                aab(a(1228288405, var26 ^ -934656945), 4573205704718874271L),
                                                aab(a(1228288406, var26 ^ 932873355), 944531883011503034L)
                                             ),
                                             abb(
                                                aab(a(1228288407, var26 ^ -1076092465), 6471182867173908705L),
                                                aab(a(1228288400, var26 ^ 1507949012), 5513933276910241661L),
                                                aab(a(1228288401, var26 ^ 556073899), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288402, var26 ^ 945942329), 290897963648073389L),
                                                aab(a(1228288403, var26 ^ 409496402), 4155981251605861598L),
                                                aab(a(1228288396, var26 ^ 1377729746), 7956485830328674910L)
                                             )
                                          );
                                          bbab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288399, var26 ^ -705954668)]),
                                             abb(
                                                aab(a(1228288392, var26 ^ 91129462), 6020602552042557804L),
                                                aab(a(1228288393, var26 ^ -1039028073), 2267435677056130687L),
                                                aab(a(1228288394, var26 ^ 1479741737), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288395, var26 ^ -1571276653), 5052260872381308968L),
                                                aab(a(1228288388, var26 ^ -1331478214), 1011960189363382145L),
                                                aab(a(1228288389, var26 ^ -1569057080), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288390, var26 ^ -1971217917), 7015464504757881730L),
                                                aab(a(1228288391, var26 ^ -490453421), 8077958274173563882L),
                                                aab(a(1228288384, var26 ^ 75443336), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288385, var26 ^ -704051341), 1965288890615603448L),
                                                aab(a(1228288386, var26 ^ -2092027850), 8931184414613437099L),
                                                aab(a(1228288387, var26 ^ -1941009085), 5487831066075976473L)
                                             ),
                                             abb(
                                                aab(a(1228288508, var26 ^ 822180991), 4573205704718874271L),
                                                aab(a(1228288509, var26 ^ -1838535604), 8628188599814694136L),
                                                aab(a(1228288510, var26 ^ -884667596), 8937878419486709506L)
                                             ),
                                             abb(3, 5, aab(a(1228288511, var26 ^ -767945136), 944531883011503034L)),
                                             abb(
                                                aab(a(1228288504, var26 ^ 454966841), 2154247335476271129L),
                                                aab(a(1228288505, var26 ^ -1381071974), 301642469318958802L),
                                                aab(a(1228288506, var26 ^ -2044245207), 7633531214655475734L)
                                             ),
                                             abb(
                                                aab(a(1228288507, var26 ^ 1727786353), 6104822230724315261L),
                                                aab(a(1228288500, var26 ^ -1193466749), 4907017903225878233L),
                                                aab(a(1228288501, var26 ^ 1166431587), 4565237973334582505L)
                                             )
                                          );
                                          abaa = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288496, var26 ^ -1720027708)]),
                                             abb(
                                                aab(a(1228288497, var26 ^ 1039649370), 7633531214655475734L),
                                                aab(a(1228288498, var26 ^ -308090240), 6561197752596374288L),
                                                aab(a(1228288499, var26 ^ 641342847), 4059851335138177250L)
                                             ),
                                             abb(
                                                aab(a(1228288492, var26 ^ 1359185611), 7633531214655475734L),
                                                aab(a(1228288493, var26 ^ -982054593), 998920642560127884L),
                                                aab(a(1228288494, var26 ^ 1724484131), 4954652435858751228L)
                                             ),
                                             abb(
                                                aab(a(1228288495, var26 ^ -889336938), 7633531214655475734L),
                                                aab(a(1228288488, var26 ^ -774520389), 2417565534520884696L),
                                                aab(a(1228288489, var26 ^ 1628603717), 8903592493020089056L)
                                             ),
                                             abb(
                                                aab(a(1228288490, var26 ^ -501453182), 4216763302145763224L),
                                                aab(a(1228288491, var26 ^ 792441969), 4727025530548689577L),
                                                aab(a(1228288484, var26 ^ -1033201990), 6003987280212594195L)
                                             ),
                                             abb(
                                                aab(a(1228288485, var26 ^ -566610377), 1965288890615603448L),
                                                aab(a(1228288486, var26 ^ -697449478), 4573205704718874271L),
                                                aab(a(1228288487, var26 ^ 1710000152), 3510994092461735382L)
                                             ),
                                             abb(
                                                aab(a(1228288480, var26 ^ 2011199612), 8628188599814694136L),
                                                3,
                                                aab(a(1228288481, var26 ^ -496554280), 3663383110621354047L)
                                             ),
                                             abb(
                                                aab(a(1228288482, var26 ^ -145858513), 7633531214655475734L),
                                                aab(a(1228288483, var26 ^ -1100856079), 8959656859491820351L),
                                                aab(a(1228288476, var26 ^ -569963627), 1047136558368341059L)
                                             ),
                                             abb(
                                                aab(a(1228288477, var26 ^ -1918151510), 563374742647212128L),
                                                aab(a(1228288478, var26 ^ -1317812641), 9143386050797803309L),
                                                aab(a(1228288479, var26 ^ 1867896561), 1960008747309538091L)
                                             )
                                          );
                                          bab = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288474, var26 ^ -718873094)]),
                                             abb(
                                                aab(a(1228288475, var26 ^ 1802003218), 1351022141499980590L),
                                                aab(a(1228288468, var26 ^ -378499896), 4712461090140822817L),
                                                aab(a(1228288469, var26 ^ 1899415558), 8077958274173563882L)
                                             ),
                                             abb(
                                                aab(a(1228288470, var26 ^ 785491553), 122807219287725406L),
                                                aab(a(1228288471, var26 ^ 442987776), 3055690771787146570L),
                                                aab(a(1228288464, var26 ^ -1713338284), 2445978862926237051L)
                                             ),
                                             abb(
                                                aab(a(1228288465, var26 ^ 36995531), 1956400272628857158L),
                                                aab(a(1228288466, var26 ^ 1138778021), 5287910095698304647L),
                                                aab(a(1228288467, var26 ^ 192784436), 8903592493020089056L)
                                             ),
                                             abb(
                                                aab(a(1228288460, var26 ^ -995474404), 8360331305712215924L),
                                                aab(a(1228288461, var26 ^ -305620768), 3000172933473612618L),
                                                aab(a(1228288462, var26 ^ -1632606106), 5348092374982888408L)
                                             ),
                                             abb(
                                                aab(a(1228288463, var26 ^ 1407086229), 944531883011503034L),
                                                aab(a(1228288456, var26 ^ -263694461), 8810023009359101827L),
                                                aab(a(1228288457, var26 ^ 602522707), 3484268458686092096L)
                                             ),
                                             abb(
                                                aab(a(1228288458, var26 ^ 916155380), 1666460625251219299L),
                                                aab(a(1228288459, var26 ^ -1889392803), 4573205704718874271L),
                                                aab(a(1228288452, var26 ^ -727581764), 8628188599814694136L)
                                             ),
                                             abb(
                                                aab(a(1228288453, var26 ^ -1481842904), 705944066922837930L),
                                                aab(a(1228288454, var26 ^ 549845628), 1237612588862850827L),
                                                aab(a(1228288455, var26 ^ 752134153), 1210755091904459984L)
                                             ),
                                             abb(
                                                aab(a(1228288448, var26 ^ -44357923), 7015464504757881730L),
                                                aab(a(1228288449, var26 ^ 2109451171), 6083937665397417893L),
                                                aab(a(1228288450, var26 ^ 1895598403), 5512071967158656410L)
                                             )
                                          );
                                          bbba = new babaabb(
                                             aabbaaaba.aaab(var8[a(1228288061, var26 ^ -70023257)]),
                                             abb(
                                                aab(a(1228288062, var26 ^ -1059489474), 2914314646354857621L),
                                                aab(a(1228288063, var26 ^ -573956649), 2422054331075961077L),
                                                aab(a(1228288056, var26 ^ 1307504356), 301642469318958802L)
                                             ),
                                             abb(
                                                aab(a(1228288057, var26 ^ 1801103769), 998920642560127884L),
                                                aab(a(1228288058, var26 ^ -961910681), 7357616444388637173L),
                                                aab(a(1228288059, var26 ^ -906914200), 6145484880887064008L)
                                             ),
                                             abb(
                                                aab(a(1228288052, var26 ^ -545163083), 898341377869943912L),
                                                aab(a(1228288053, var26 ^ 31850393), 8545058908539677814L),
                                                aab(a(1228288054, var26 ^ -1245980157), 5856180623712363527L)
                                             ),
                                             abb(
                                                aab(a(1228288055, var26 ^ 120389166), 8311098077217910084L),
                                                aab(a(1228288048, var26 ^ -347591215), 8705752287964337429L),
                                                aab(a(1228288049, var26 ^ -1031155063), 6003987280212594195L)
                                             ),
                                             abb(
                                                aab(a(1228288050, var26 ^ 951064693), 8426186879079329148L),
                                                aab(a(1228288051, var26 ^ -1848670275), 944531883011503034L),
                                                aab(a(1228288044, var26 ^ -1429378886), 3510994092461735382L)
                                             ),
                                             abb(
                                                5,
                                                aab(a(1228288045, var26 ^ -2060067210), 1666460625251219299L),
                                                aab(a(1228288046, var26 ^ -629187006), 7178326575363070340L)
                                             ),
                                             abb(
                                                aab(a(1228288047, var26 ^ -2064622933), 5513933276910241661L),
                                                aab(a(1228288040, var26 ^ 835704966), 8008127929311884886L),
                                                aab(a(1228288041, var26 ^ -1260986887), 5677986311253007161L)
                                             ),
                                             abb(
                                                aab(a(1228288042, var26 ^ -979294195), 3434597758659681517L),
                                                aab(a(1228288043, var26 ^ -1875367391), 2323239015759440154L),
                                                aab(a(1228288036, var26 ^ -361085543), 6487693875220480497L)
                                             )
                                          );
                                          aaaa = aba();
                                          return;
                                       }
                                       break;
                                    default:
                                       var35[var48] = var102;
                                       if (var2 < var5) {
                                          continue label97;
                                       }

                                       var5 = (var4 = aaba(29939, var26 ^ -358225600, '済')).length();
                                       var2 = 0;
                                 }

                                 short var51 = var2;
                                 var2 += 8;
                                 String var36 = var4.substring(var51, var2);
                                 var51 = 17710;
                                 int var70 = var26 ^ 2087102187;
                                 var91 = 28169;
                                 var7 = var36.getBytes("ISO-8859-1");
                                 var35 = var6;
                                 var48 = var3++;
                                 var68 = (var7[0] & 255L) << a(1228288787, var26 ^ 1815026702)
                                    | (var7[1] & 255L) << a(1228288780, var26 ^ 1629078504)
                                    | (var7[2] & 255L) << a(1228288781, var26 ^ 811786238)
                                    | (var7[3] & 255L) << a(1228288782, var26 ^ 1544742184)
                                    | (var7[4] & 255L) << a(1228288783, var26 ^ -48103952)
                                    | (var7[5] & 255L) << a(1228288776, var26 ^ 2073330283)
                                    | (var7[a(1228288777, var26 ^ -443161592)] & 255L) << a(1228288778, var26 ^ 1181526693)
                                    | var7[a(1228288779, var26 ^ -108014303)] & 255L;
                                 var91 = 0;
                              }
                           }
                        }

                        var10 = var11.charAt(var29);
                        break;
                     default:
                        var8[var12++] = var89;
                        if ((var29 += var10) < var13) {
                           var10 = var11.charAt(var29);
                           continue label123;
                        }

                        var13 = (var11 = aaba(5586, var26 ^ 94732720, '渍')).length();
                        var10 = a(1228288800, var26 ^ 1262048085);
                        var29 = -1;
                  }

                  var32 = var11.substring(++var29, var29 + var10);
                  var10001 = (byte)0;
               }
            }
         }

         do {
            var21 = var17[var19];
            char[] var23 = var16.substring(var20, var20 + var21).toCharArray();
            int var24 = 0;

            do {
               short var25 = switch (var24 % 5) {
                  default -> 21;
                  case 1 -> 111;
                  case 2 -> 85;
                  case 3 -> 252;
                  case 4 -> 11;
               };
               var23[var24] = (char)(var23[var24] ^ var25 ^ var15);
            } while (++var24 < var23.length);

            var18[var19] = new String(var23).intern();
            var20 += var21;
         } while (++var19 < var17.length);

         var22 = 0;
      }
   }

   public Color aa() {
      return this.abba;
   }

   public Color ab() {
      return this.bbb;
   }

   public ababbbbaa aaa() {
      return this.aaab;
   }

   private static int aab(int var0, long var1) {
      int var3 = var0 ^ (int)(var1 & 32767L) ^ a(1228288828, -2131999956 ^ 1511462446);
      if (bb[var3] == null) {
         bb[var3] = (int)(ababa[var3] ^ var1);
      }

      return bb[var3];
   }

   private static babaabb[] aba() {
      int var0 = -73105436;
      babaabb[] var10000 = new babaabb[aab(
         a(1228288829, var0 ^ -610249400), 8311098077217910084L
      )];
      var10000[0] = aabbb;
      var10000[1] = bbaa;
      var10000[2] = baa;
      var10000[3] = bbbb;
      var10000[4] = aaaab;
      var10000[5] = baba;
      var10000[aab(a(1228288830, var0 ^ 24921693), 1666460625251219299L)] = bba;
      var10000[aab(a(1228288831, var0 ^ -688498682), 4573205704718874271L)] = abaaa;
      var10000[aab(a(1228288824, var0 ^ -479485400), 7178326575363070340L)] = aa;
      var10000[aab(a(1228288825, var0 ^ -1556285910), 3663383110621354047L)] = aabb;
      var10000[aab(a(1228288826, var0 ^ -952495977), 8628188599814694136L)] = aba;
      var10000[aab(a(1228288827, var0 ^ -123582858), 9050315856985416689L)] = aaaaa;
      var10000[aab(a(1228288820, var0 ^ -1224358496), 8426186879079329148L)] = baaa;
      var10000[aab(a(1228288821, var0 ^ -1155096421), 944531883011503034L)] = aabab;
      var10000[aab(a(1228288822, var0 ^ 2071386418), 2151762808925216753L)] = ababb;
      var10000[aab(a(1228288823, var0 ^ -5985832), 8810023009359101827L)] = aaba;
      var10000[aab(a(1228288816, var0 ^ -172474596), 3510994092461735382L)] = aabaa;
      var10000[aab(a(1228288817, var0 ^ -1030883841), 7616375181909950680L)] = abaab;
      var10000[aab(a(1228288818, var0 ^ 535988005), 1965288890615603448L)] = baab;
      var10000[aab(a(1228288819, var0 ^ -1206406723), 3484268458686092096L)] = aab;
      var10000[aab(a(1228288812, var0 ^ 256315366), 4727025530548689577L)] = abab;
      var10000[aab(a(1228288813, var0 ^ -259658255), 4024948953023738258L)] = abbb;
      var10000[aab(a(1228288814, var0 ^ -1623648233), 8937878419486709506L)] = a;
      var10000[aab(a(1228288815, var0 ^ 969157046), 7653713980845441640L)] = aaa;
      var10000[aab(a(1228288808, var0 ^ -1530440559), 8931184414613437099L)] = b;
      var10000[aab(a(1228288809, var0 ^ 84944623), 2232222131537269456L)] = abb;
      var10000[aab(a(1228288810, var0 ^ -642180954), 7766401513142392187L)] = bbab;
      var10000[aab(a(1228288811, var0 ^ -1997154679), 5757442261128209517L)] = abaa;
      var10000[aab(a(1228288804, var0 ^ -453679404), 2066098345999352765L)] = bab;
      var10000[aab(a(1228288805, var0 ^ -874985956), 8790255723164574275L)] = bbba;
      return var10000;
   }

   private static Color abb(int var0, int var1, int var2) {
      return new Color(var0, var1, var2, aab(a(1228288037, -957889681 ^ 1283177948), 7633531214655475734L));
   }

   @Override
   public String toString() {
      return this.aaab.abab();
   }

   public Color baa() {
      return this.ba;
   }

   private static String aaba(int var0, int var1, char var2) {
      int var3 = var2 ^ 28172;
      char[] var4 = abbab[var3].toCharArray();
      StackTraceElement[] var5 = (StackTraceElement[])abbba[var3];
      StackTraceElement[] var6;
      if (var5 != null) {
         var6 = var5;
      } else {
         var6 = new Throwable().getStackTrace();
         abbba[var3] = var6;
      }

      StackTraceElement var7 = var6[1];
      int var8 = (var7.getClassName().hashCode() ^ var7.getMethodName().hashCode()) >> 16 ^ 32245;
      int var9 = 0;

      do {
         int var10 = var4[var9] + '혏';
         var10 ^= 27388;
         var10 ^= 17601;
         var10 += 28393;
         var10 -= 17886;
         var10 += 13074;
         var10 ^= 12525;
         var10 += 34803;
         var10 -= 60196;
         var10 ^= 61741;
         var4[var9] = (char)(var10 ^ var8 ^ var0 ^ var1 >> 16);
      } while (++var9 < var4.length);

      return new String(var4).intern();
   }

   private static int a(int var0, int var1) {
      int var2 = abbaa[var0 ^ 1228288828] ^ var1 ^ var0;
      var2 ^= 18169;
      var2 -= 26719;
      var2 ^= 23017;
      var2 -= 58575;
      var2 += 54965;
      return var2 ^ 50075;
   }

   public Color bab() {
      return this.ab;
   }

   public Color bba() {
      return this.aaaba;
   }

   public Color bbb() {
      return this.babb;
   }

   public Color aaaa() {
      return this.aaabb;
   }

   public static babaabb aaab(String var0) {
      return Enum.valueOf(babaabb.class, var0);
   }

   private babaabb(
      ababbbbaa var3, Color var4, Color var5, Color var6, Color var7, Color var8, Color var9, Color var10, Color var11
   ) {
      this.aaab = var3;
      this.abba = var4;
      this.babb = var5;
      this.ab = var6;
      this.aaaba = var7;
      this.ba = var8;
      this.aabba = var9;
      this.bbb = var10;
      this.aaabb = var11;
   }
}
